emacs.2023.symlink/init.org
# -*-   mode:org; org-confirm-babel-evaluate: nil; org-time-stamp-formats: ("%Y-%m-%d" . "%Y-%m-%d %H:%M") -*-
#+TITLE: init.org
#+PROPERTY: header-args :results none
* Early setup
** Keymaps

I use a custom keymap for leader bindings, which we create early as lots of
code depends on it:

#+BEGIN_SRC emacs-lisp
(define-prefix-command 'md/leader-map)
#+END_SRC

** Dotfiles

I'm using org-mode to structure my configuration. Originally inspired by [[https://github.com/sachac/.emacs.d][Sacha
Chua]] and [[https://github.com/eschulte/emacs24-starter-kit/][Emacs Starter Kit]]. I want to be able to easily edit and compile this
file.

The rest of the file makes heavy use of use-package's features for setting
variables and key bindings, but it hasn't been loaded yet and I want it to be
easy to edit this file, so we use bind-key manually:

#+BEGIN_SRC emacs-lisp
(defun md/maybe-native-compile-and-load (path loadp)
  "If a file exists and Emacs has the native compilation feature enabled,
use it to compile the file"
  (if (and path (file-exists-p path))
      (progn
        (when loadp
          (load-file path))
        (when (fboundp 'native-compile-async)
          (native-compile-async path t)))
    (message "Cannot load-file, doesn't exist: %s" path)))

(defun md/dotfiles-edit-init ()
  "Jump to my my init.org"
  (interactive)
  (find-file (md/emacs-get-path "init.org")))

(require 'bind-key)
(bind-key "ve" 'md/dotfiles-edit-init md/leader-map)
(bind-key "vc" 'md/dotfiles-compile-all md/leader-map)  ;; Defined in early-init file
#+END_SRC

** Xrandr

On Linux I use exwm to manage X windows/applications. These helpers let me
easily change monitor configurations. I define them early as I want to easily be
able to configure monitors, even if something breaks later in the file.

#+BEGIN_SRC emacs-lisp
(defun md/exwm-display-one ()
  "If monitor is connected, only use that. Otherwise, only use the main display."
  (interactive)
  (let ((xrandr-output-regexp "\n\\([^ ]+\\) connected ")
        default-output)
    (with-temp-buffer
      (call-process "xrandr" nil t nil)
      (goto-char (point-min))
      (re-search-forward xrandr-output-regexp nil 'noerror)
      (setq default-output (match-string 1))
      (forward-line)
      (if (not (re-search-forward xrandr-output-regexp nil 'noerror))
          (call-process "xrandr" nil nil nil "--output" default-output "--auto")
        (call-process
         "xrandr" nil nil nil
         "--output" (match-string 1) "--mode"
         (completing-read "Resolution: " '("2048x1080" "1920x1080" "2560x1440"))
         "--primary"
         "--output" default-output "--off")
        (setq exwm-randr-workspace-output-plist (list 0 (match-string 1)))))))

(defun md/exwm-display-mirror ()
  "Mirror display"
  (interactive)
  (let ((xrandr-output-regexp "\n\\([^ ]+\\) connected ")
        default-output)
    (with-temp-buffer
      (call-process "xrandr" nil t nil)
      (goto-char (point-min))
      (re-search-forward xrandr-output-regexp nil 'noerror)
      (setq default-output (match-string 1))
      (forward-line)
      (if (not (re-search-forward xrandr-output-regexp nil 'noerror))
          (call-process "xrandr" nil nil nil "--output" default-output "--auto")
        (call-process
         "xrandr" nil nil nil
         "--output" default-output "--auto" "--primary"
         "--output" (match-string 1) "--auto" "--same-as" default-output)
        (setq exwm-randr-workspace-output-plist (list 0 default-output))))))

#+END_SRC

** Compat fix

[2023-11-19] I'm not sure what's happening exactly but compat-string-width is
expected to exist by consult, but doesn't. Defining it here early as a workaround.

#+begin_src emacs-lisp
(defun compat-string-width (STRING &optional FROM TO)
  (string-width STRING FROM TO))
#+end_src

* [[https://github.com/radian-software/straight.el][Straight]] and [[https://github.com/jwiegley/use-package][use-package]]
:PROPERTIES:
:LAST_REVIEWED: [2023-06-02 Fri]
:END:

I'm using straight to easily install packages and manage package
versions. They're automatically installed on startup as we default to setting
~:straight t~ in use-package.

The default installation instructions recommend eval'ing code from Github - I've
commented out that part below but that's one way I could re-install straight in
the future if I needed to and was happy with the Github content etc.

#+BEGIN_SRC emacs-lisp
(defvar straight-bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (straight-bootstrap-version 6))
  ;; (unless (file-exists-p bootstrap-file)
  ;;   (with-current-buffer
  ;;       (url-retrieve-synchronously
  ;;        "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
  ;;        'silent 'inhibit-cookies)
  ;;     (goto-char (point-max))
  ;;     (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Equivalent of using :straight t with use-package
(setq straight-use-package-by-default t)
#+END_SRC

Install use-package:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'use-package)
#+END_SRC

Configure use-package. We add a custom keyword ~:md/bind~ here. This is my
alternative to the included ~:bind~ keyword. It has fewer features overall
compared to ~:bind~, but offers two additional features that I miss - see the
docstring below.

#+BEGIN_SRC emacs-lisp
(use-package use-package
  :custom
  (use-package-verbose t)
  (use-package-minimum-reported-time 0.001)

  :config
  (add-to-list 'use-package-keywords :md/bind t)

  (defun use-package-normalize/:md/bind (name keyword args)
    "Custom use-keyword :md/bind. I use this to provide something similar to ':bind',
but with additional two features that I miss from the default implementation:

1. Integration with 'evil-define-key', so I can extend the keymap declaration
   to specify one or more evil states that the binding should apply to.

2. The ability to detect keymaps that aren't defined as prefix commands. This
   allows me to define a binding to a keymap variable, eg. maybe I want '<leader>h'
   to trigger 'help-map'. This fails using the default ':bind', meaning that I
   have to fall back to calling 'bind-key' manually if I want to assign a
   prefix.

The expected form is slightly different to 'bind':

((:map (KEYMAP . STATE) (KEY . FUNC) (KEY . FUNC) ...)
 (:map (KEYMAP . STATE) (KEY . FUNC) (KEY . FUNC) ...) ...)

STATE is the evil state. It can be nil or omitted entirely. If given, it should be an
argument suitable for passing to 'evil-define-key' -- meaning a symbol like 'normal', or
a list like '(normal insert)'."
    (setq args (car args))
    (unless (listp args)
      (use-package-error ":md/bind expects ((:map (MAP . STATE) (KEY . FUNC) ..) ..)"))
    (dolist (def args args)
      (unless (and (eq (car def) :map)
                   (consp (cdr def))
                   (listp (cddr def)))
        (use-package-error ":md/bind expects ((:map (MAP . STATE) (KEY . FUNC) ..) ..)"))))

  (defun use-package-handler/:md/bind (name _keyword args rest state)
    "Handler for ':md/bind' use-package extension. See 'use-package-normalize/:md/bind' for full docs."
    (let ((body (use-package-process-keywords name rest
                  (use-package-plist-delete state :md/bind))))
      (use-package-concat
       `((with-eval-after-load ',name
           ,@(mapcan
              (lambda (entry)
                (let ((keymap (car (cadr entry)))
                      (state (cdr (cadr entry)))
                      (bindings (cddr entry)))
                  (mapcar
                   (lambda (binding)
                     (let ((key (car binding))
                           (val (if (and (boundp (cdr binding)) (keymapp (symbol-value (cdr binding))))
                                    ;; Keymaps need to be vars without quotes
                                    (cdr binding)
                                  ;; But functions need to be quoted symbols
                                  `(quote ,(cdr binding)))))
                       ;; When state is provided, use evil-define-key. Otherwise fall back to bind-key.
                       (if state
                           `(evil-define-key ',state ,keymap (kbd ,key) ,val)
                         `(bind-key ,key ,val ,keymap))))
                   bindings)))
              args)))
       body))))
#+END_SRC

Include melpa stable (as this isn't in the default list but is needed for ~gptel~):

#+begin_src emacs-lisp
;; TODO: erroring on start, must be wrong format.
;;(add-to-list
;; 'straight-recipe-repositories
;; '(melpa-stable . "https://stable.melpa.org/packages/")
;; t)
#+end_src

* [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]]

In some setups (eg. if you launch the macOS Emacs app), Emacs doesn't inherit
PATH or other key variables that you might have configured in a bashrc
file. ~exec-path-from-shell~ fixes that.

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns))
  :demand t
  :config
  ;; Define vars to inherit beyond the default PATH and MANPATH
  (setq exec-path-from-shell-variables
        '("DOTFILES"
          "MANPATH"
          "PATH"))
  (exec-path-from-shell-initialize))
#+END_SRC

