emacs.2023.symlink/init.org
* Vanilla configuration and utils

This section just contains general utils and configuration code
that's mostly only concerned with vanilla Emacs (with a couple of exceptions,
eg. the ~s~ library dependency).

#+begin_src emacs-lisp
(use-package emacs
  :after (s)

  ;; ======================================================================
  :init

  (defmacro md/with-widened-buffer (buffer-or-name &rest body)
    "Widen the given BUFFER-OR-NAME, execute BODY in the context of your current buffer, and restore restrictions on the given buffer.

This allows the calling code to not have to worry about manually handling
narrowed vs widened state."
    (let ((orig-buffer (gensym "orig-buffer")))
      `(let ((,orig-buffer (current-buffer)))
         (with-current-buffer ,buffer-or-name
           (save-restriction
             (save-excursion
               (widen)
               (with-current-buffer ,orig-buffer
                 ,@body)))))))

  (defun md/find-file-buffer (path)
    "Get or create a buffer visiting PATH without affecting current windows.

This is useful in situations where you have functions that accept a buffer object but you
only have the file path."
    (save-window-excursion
      (find-file path)
      (current-buffer)))

(defun md/messages-toggle ()
  "Visit or hide the *Messages* buffer"
  (interactive)
  (if (get-buffer-window "*Messages*")
      (delete-window (get-buffer-window "*Messages*"))
    (pop-to-buffer "*Messages*")))

  (defun md/save-if-not-remote ()
    "I usually save files often (eg. when exiting insert-mode in evil).
Usually this is helpful, but if I'm using tramp to edit a remote file,
it can result in extra latency."
    (interactive)
    (if (not (file-remote-p default-directory))
        (save-buffer)))

  (defun md/strip-whitespace-and-save ()
    "Helper to clean up whitespace and save, which I run often."
    (interactive)
    (delete-trailing-whitespace)
    (save-buffer))

  (defun md/file-info ()
    "Print info about the file in the minibuffer"
    (interactive)
    (message
     "%s | %s %d:%d | %s lines | [%s]"
     major-mode
     (buffer-file-name)
     (array-current-line) ; current line
     (current-column) ; column
     (count-lines (point-min) (point-max)) ; total lines
     (let ((p (and (fboundp 'project-current) (project-current))))
       (if p
           (project-name p)
         "no project"))))

(defun md/project-copy-visited-file-path ()
  "Copy the file path relative to the current project root to the clipboard."
  (interactive)
  (if (buffer-file-name)
      (let* ((project-root (if (fboundp 'project-current)
                               (car (last (project-current)))
                             nil))
             (relative-path (if project-root
                                (file-relative-name buffer-file-name project-root)
                              buffer-file-name)))
        (kill-new relative-path)
        (message "Copied relative file path '%s'." relative-path))
    (message "No file is currently being visited.")))

  (defun md/toggle-debug-on-error ()
    "When enabled, this feature causes a debug buffer to pop up when there's an
    error. Helpful for er, debugging."
    (interactive)
    (setq debug-on-error (not debug-on-error))
    (message (format "debug-on-error %s" debug-on-error)))

  (defun md/status-message ()
    "Runs a script that prints some system info (time, battery etc.) and
echos results in the minibuffer. Only works on linux."
    (interactive)
    (let* ((message-log-max nil) ; ensure not logged in message buffer
           (output (s-trim-right
                    (shell-command-to-string "/f/users/matt/.config/i3-status-bash-once.sh")))
           (output-as-list (car (read-from-string output)))
           (propertized-string (mapconcat
                                (lambda (item)
                                  (concat
                                   (propertize (nth 0 item)
                                               'face
                                               `(:foreground ,(nth 2 item) :family "Font Awesome 5 Free" :height 0.6))
                                   (propertize (nth 1 item)
                                               'face
                                               `(:foreground ,(nth 2 item) :family "Noto sans" :height 0.7))))
                                output-as-list "")))
      (message propertized-string)))

  (defun md/fontify-buffer ()
    "Wrapper around font-lock-fontify-buffer, that tells me if it's working or not."
    (interactive)
    (if font-lock-mode
        (progn (call-interactively 'font-lock-fontify-buffer)
               (message "Fontified buffer"))
      (message "Not in font-lock-mode")))

  (defun md/font-size-incr ()
    "Increase the size of the default font."
    (interactive)
    (set-face-attribute 'default nil :height (+ (face-attribute 'default :height) 5)))

  (defun md/font-size-decr ()
    "Decrease the size of the default font."
    (interactive)
    (set-face-attribute 'default nil :height (- (face-attribute 'default :height) 6)))

  (defun md/remove-file-and-buffer ()
    "Kill the current buffer and delete the file it's visiting (calling `git rm` if appropriate)."
    (interactive)
    (let ((filename (buffer-file-name)))
      (when
          (and filename
               (string= (read-string (format "Delete %s? (y/n) " filename)) "y"))
        (if (vc-backend filename)
            (vc-delete-file filename)
          (progn
            (delete-file filename)
            (message "Deleted file %s" filename)
            (kill-buffer))))))

  (defun md/rename-file-and-buffer ()
    "Rename the current buffer and the file its visiting (calling `git mv` if appropriate)."
    (interactive)
    (let ((filename (buffer-file-name)))
      (if (not (and filename (file-exists-p filename)))
          (message "Buffer is not visiting a file!")
        (let ((new-name (read-file-name "New name: " filename)))
          (cond
           ((vc-backend filename) (vc-rename-file filename new-name))
           (t
            (rename-file filename new-name t)
            (set-visited-file-name new-name t t)))))))

  (defun md/expand-newlines ()
    "Replace \n characters with an actual newline. Useful for making traceback strings readable."
    (interactive)
    (funcall-interactively 'replace-string "\\n" "
 " nil (region-beginning) (region-end)))

  (defun md/make-keymap-noop (kmap)
    "Overwrite bindings on a given keymap to perform a noop function.  There
might be a better way to do this (eg. unset the binding) but I've had this code
for ages and it seems to work."
    (mapc (lambda (key)
            (bind-key key 'ignore kmap)
            (bind-key (concat "C-" key) 'ignore kmap)
            (bind-key (concat "M-" key) 'ignore kmap)
            (bind-key (concat "C-M-" key) 'ignore kmap)
            (bind-key (capitalize key) 'ignore kmap)
            (bind-key (concat "C-" (capitalize key)) 'ignore kmap)
            (bind-key (concat "M-" (capitalize key)) 'ignore kmap)
            (bind-key (concat "C-M-" (capitalize key)) 'ignore kmap))
          '("a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n" "o" "p" "q" "r"
            "s" "t" "u" "v" "w" "x" "y" "z"
            "1" "2" "3" "4" "5" "6" "7" "8" "9" "0"))
    (mapc (lambda (key)
            (bind-key key 'ignore kmap))
          '("SPC" "TAB")))

  (defun md/insert-blank-line-before ()
    "Util that I map to <leader>o to insert a new line."
    (interactive)
    (save-excursion
      (end-of-line)
      (open-line 1)
      (md/save-if-not-remote)))

  (defun md/quit-and-kill-window ()
    "Wrapper around quit-window that always kills the buffer instead of just hiding it."
    (interactive)
    (quit-window t))

  (defun md/system-lock ()
    "Linux util to lock the screen."
    (interactive)
    (shell-command "xset dpms force off >/dev/null 2>&1 & disown" nil nil))

  (defun md/system-sleep ()
    "Linux util to sleep."
    (interactive)
    (shell-command "systemctl suspend -i >/dev/null 2>&1 & disown" nil nil))

  (defun md/system-restart ()
    "Linux util to restart."
    (interactive)
    (shell-command "systemctl reboot -i >/dev/null 2>&1 & disown" nil nil))

  (defun md/system-shutdown ()
    "Linux util to shutdown."
    (interactive)
    (shell-command "systemctl poweroff -i >/dev/null 2>&1 & disown" nil nil))

  (defun md/screenshot-image-selection ()
    "Linux util to create a screenshot with a selection."
    (interactive)
    (shell-command ",screenshot --image-selection"))

  (defun md/screenshot-video-selection-start ()
    "Linux util to create a video screenshot with a selection."
    (interactive)
    (shell-command ",screenshot --video-selection-start"))

  (defun md/screenshot-video-stop ()
    "Linux util to stop a started video screenshot."
    (interactive)
    (shell-command ",screenshot --video-stop"))

  (defconst md/scratch-file-elisp "~/.emacs-scratch.el")
  (defun md/scratch-open-file-elisp ()
    "Open a persistent emacs-lisp 'scratch' file in my home directory. "
    (interactive)
    (find-file md/scratch-file-elisp))

  (defconst md/scratch-file-org "~/.emacs-scratch.org")
  (defun md/scratch-open-file-org ()
    "Open a persistent org 'scratch' file in my home directory. "
    (interactive)
    (find-file md/scratch-file-org))

  (defun md/toggle-window-dedicated ()
    "Use set-window-dedicated-p to toggle between a dedicated and non-dedicated window.

    Dedicated windows are fixed to displaying the current buffer."
    (interactive)
    (set-window-dedicated-p (selected-window) (not (window-dedicated-p)))
    (if (window-dedicated-p)
        (message "Dedicated")
      (message "Removed dedicated mode")))

  (defun md/disable-all-themes ()
    "Disable all current themes."
    (interactive)
    (mapc #'disable-theme custom-enabled-themes))

  (defun md/load-theme ()
    "Wrapper to make load-theme more useful.

We disable all enabled themes before new theme selection, and then
make sure that we properly reload by fontifying the buffer etc.

Uses consult-theme if available."
    (interactive)
    (md/disable-all-themes)
    (setq org-todo-keyword-faces nil)
    (if (fboundp 'consult-theme)
        ;; consult-theme previews themes on the fly as you select them
        (call-interactively 'consult-theme)
      (call-interactively 'load-theme))
    ;; I don't like when themes show the fringe or git gutter with a different
    ;; background colour in the margin, so ensure this always matches the
    ;; default background
    (face-spec-set 'fringe
                   `((t :inherit 'default
                        :background ,(face-attribute 'default :background))))
    (face-spec-set 'git-gutter:unchanged
                   `((t :inherit 'default
                        :background ,(face-attribute 'default :background))))
    (face-spec-set 'git-gutter:separator
                   `((t :inherit 'default
                        :background ,(face-attribute 'default :background))))
    ;; Other theme customising

    ;;(md/powerline-reset)
    (md/fontify-buffer)
    (set-window-buffer nil (current-buffer)))

(defmacro md/with-display-buffer-alist (rule &rest body)
  "Temporarily override `display-buffer-alist` with RULE for the duration of BODY.
RULE is a list describing the buffer display rule. This rule takes precedence
over any existing rules with the same match pattern."
  `(let ((original-display-buffer-alist display-buffer-alist))
     ;; Add the new rule at the front, so it takes precedence
     (unwind-protect
         (progn
           (push ,rule display-buffer-alist)
           ,@body)
       ;; Restore the original display-buffer-alist afterwards
       (setq display-buffer-alist original-display-buffer-alist))))

(defun md/display-buffer-in-overlay-margin (buffer _alist)
  "Display BUFFER as an overlay instead of a window. To be called in display buffer alist config"
  (md/do-display-buffer-in-overlay-margin buffer)
  ;; Return nil to signal that we didn't use a regular window for display.
  ;; Return 'display-buffer-no-window to prevent displaying the buffer in a window.
  'display-buffer-no-window)

(defun md/do-display-buffer-in-overlay-margin (buffer)
  "Show the contents of BUFFER as an overlay popup to the right margin"
  (unless (bufferp buffer)
    (error "Argument must be a buffer object"))
  (let* ((content (with-current-buffer buffer
                    ;; Ensure font-lock is applied to the buffer
                    (font-lock-ensure)
                    (buffer-substring (point-min) (point-max))))
         ;; Strip trailing newlines from content
         (stripped-content (replace-regexp-in-string "\n\\'" "" content))
         ;; Split content into lines
         (lines (split-string stripped-content "\n"))
         (overlay-list nil)
         (event nil)
         ;; Determine the number of lines in the overlay content
         (overlay-line-count (length lines))
         (max-width 0)) ;; Initialize max-width

    ;; Process each line in the popup content
    (save-excursion
      ;; Calculate the maximum width of the buffer lines where the overlay will be displayed
      (dotimes (i overlay-line-count)
        (end-of-line)
        (setq max-width (max max-width (current-column)))
        (forward-line 1)) ;; Move to the next line
      ;; Move back to the starting point
      (goto-char (point)))

    ;; Process each line in the popup content, inserting it at max-width + 2
    (save-excursion
      (dotimes (i (min overlay-line-count (- (line-number-at-pos (point-max)) (line-number-at-pos))))
        (let ((line-content (nth i lines))
              (target-column (+ max-width 2))) ;; Set the column to max-width + 2
          ;; Move to the corresponding line in the buffer
          (end-of-line)
          (let ((current-column (current-column)))
            ;; Calculate how many spaces are needed to pad to the target column
            (let ((padding (make-string (- target-column current-column) ?\s)))
              ;; Create an overlay at the current point with the padded content
              (let ((overlay (make-overlay (point) (point))))
                (overlay-put overlay 'after-string (concat padding line-content))
                (push overlay overlay-list))))
          (forward-line 1)))) ;; Move to the next line

    ;; Use unwind-protect to ensure the overlays are cleaned up even if an error occurs
    (unwind-protect
        (setq event (read-event))  ;; Capture the event (key press or quit)
      ;; Always clean up the overlays
      (mapc #'delete-overlay overlay-list))

    ;; If the event was a keypress, apply it to the buffer
    (when (characterp event)
      (setq unread-command-events (list event)))))

(defun md/do-display-buffer-in-overlay-insert (buffer)
  "Show the contents of BUFFER as an overlay popup inserted below the current line."
  (unless (bufferp buffer)
    (error "Argument must be a buffer object"))
  (let* ((content (with-current-buffer buffer
                    ;; Ensure font-lock is applied to the buffer
                    (font-lock-ensure)
                    (buffer-substring (point-min) (point-max))))
         ;; Strip trailing newlines from content
         (stripped-content (replace-regexp-in-string "\n\\'" "" content))
         (border (propertize (make-string 80 ?-) 'face 'font-lock-comment-face)) ;; Create a bordered string with face
         (bordered-content (concat border "\n"  ;; Top border with comment face
                                   stripped-content "\n" ;; Stripped content
                                   border "\n")) ;; Bottom border with comment face
         (overlay nil)
         (event nil))

    ;; Move the point to the beginning of the next line without inserting a newline
    (save-excursion
      (forward-line 1) ;; Move to the next line
      (move-beginning-of-line 1) ;; Move to the beginning of that line
      ;; Create an overlay that starts at this point and has no width
      (setq overlay (make-overlay (point) (point))))

    ;; Set the overlay to display the bordered popup text with preserved text properties
    (overlay-put overlay 'before-string bordered-content)

    ;; Use unwind-protect to ensure the overlay is cleaned up even if an error occurs
    (unwind-protect
        (setq event (read-event))  ;; Capture the event (key press or quit)
      (delete-overlay overlay)) ;; Always clean up the overlay

    ;; If the event was a keypress, apply it to the buffer
    (when (characterp event)
      (setq unread-command-events (list event)))))

  ;; ======================================================================
  :config
  ;; Start up in fullscreen mode
  (toggle-frame-fullscreen)

  ;; By default "?" in help-map shows some help thing, but I prefer the
  ;; global behaviour of showing the key bindings for the map
  (unbind-key "?" help-map)

  ;; If the custom system is going to write to a file, don't do it in init.el -
  ;; use this file instead.
  (setq custom-file (md/emacs-get-path "custom.el"))

  ;; Wrap to 80 characters by default
  (setq-default fill-column 80)

  ;; The toolbar appears in the GUI frame. I don't want it:
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))

  ;; The menu bar is intrusive in terminal Emacs, so disable it. On the macos
  ;; app it appears as any other app toolbar at the top of the screen, which is
  ;; fine.
  (when (or (not (display-graphic-p))
            (string= (system-name) "arch"))
    (menu-bar-mode -1))

  ;; The cursor blinks by default. Disable it.
  (blink-cursor-mode -1)

  ;; Don't show scrollbars.
  (scroll-bar-mode -1)

  ;; Enable recentf so I can visit recent files..
  (recentf-mode 1)

  ;; There are various minor modes that I don't use that I've seen enabled in
  ;; the past. Make sure they're disabled.
  (dolist (this-minor-mode
           '(csv-field-index-mode
             diff-auto-refine-mode
             file-name-shadow-mode
             global-magit-file-mode
             mouse-wheel-mode))
    (when (fboundp this-minor-mode)
      (funcall this-minor-mode 0)))

  ;; ======================================================================
  :custom
  (inhibit-splash-screen t "I don't want to see the splash screen every time")
  (ring-bell-function 'ignore "Don't make a ridiculous noise when pressing C-g etc.")

  (scroll-margin 1 "How close the cursor should be to edge of page before scrolling")
  (scroll-conservatively 999 "")
  (scroll-step 1 "Only scroll one row at a time. Default behaviour is to centre the row")

  (left-margin-width 4 "Whitespace to the left of the window")
  (indent-tabs-mode nil "Use spaces instead of tabs")
  (tab-width 4 "Use 4 spaces for tabs")
  (tab-always-indent nil "Don't do magic indenting when I press tab")
  (line-spacing 0.4 "Increase the default line spacing ")

  (message-log-max 5000 "Increase default size of message buffer")
  (backup-directory-alist `(("." . ,(md/emacs-get-path ".backups"))) "Put backup files in .backups instead of dropping them everywhere")
  (delete-by-moving-to-trash t "Use the system's trash feature.")
  (recentf-max-saved-items 200 "Increase the number of recentf files")

  (vc-follow-symlinks t "I don't want to confirm this every time")
  (epa-pinentry-mode 'loopback "When showing the GPG prompt, use the minibuffer instead of popping up a separate GUI dialog box")

  (initial-buffer-choice md/scratch-file-org "Open my org scratch file on startup")

  (project-switch-commands '((project-find-file "Find file" "f")
                             (md/consult-find-dwim "Find dwim" "F")
                             (project-kill-buffers "Kill buffers" "k")
                             (consult-project-buffer "Buffers" "p")
                             (md/consult-ripgrep-dwim "Grep dwim" "/")))

  (display-buffer-alist
   `(("\\*shell"
      (display-buffer-reuse-window display-buffer-same-window))
     ("\\*edit-indirect"
      (display-buffer-same-window))
     ("*\\(help\\|Help\\|Messages\\|Warnings\\|Compile-\\|chatgpt\\|eldoc\\|eglot-help\\|gptel-log\\)"
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . bottom)
      (window-height . (lambda (win)
                         ;; Adjust window height to fit buffer contents, up to a max height of 10 lines
                         (fit-window-to-buffer win 25 4))))
     ("*\\(vterm\\)\\*"
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . bottom)
      (window-height . 0.33))
     ("\\magit: "
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . left)
      (window-width . 80))
     ("\\COMMIT_EDITMSG"
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . left)
      (window-width . 68))
     ("\\magit-log: "
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . bottom)
      (window-height . 0.33))
     ("\\*aider-"
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . right)
      (window-width . 80))
     ("\\*babel-" ;; Name prefix I'll use for babel sessions as they don't have a naming convention
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . bottom)
      (window-height . 0.33))
     ("*\\(Agenda Commands\\|Org Select\\)\\*" ;; Annoying org popups - agenda and capture selection
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . bottom)
      (window-height . 0.33))
     ("CAPTURE-.+"  ;; Org capture buffer
      (display-buffer-reuse-window display-buffer-in-side-window)
      (side . bottom)
      (window-height . 0.33)))
   "Customise how buffers are displayed. I used to use Shackle but I'm trying to stick to this for simplicity")

  (switch-to-buffer-obey-display-actions t "Ensure display-buffer-alist gets used when running switch-to-buffer, which would otherwise bypass it")

  (safe-local-variable-values
   '((org-confirm-babel-evaluate . nil)
     (org-time-stamp-formats . ("%Y-%m-%d" . "%Y-%m-%d %H:%M")))
   "Stop prompting me to accept these local variables")

  ;; ======================================================================
  :md/bind ((:map (global-map)
                  ("C-<SPC>" . md/leader-map))
            (:map (md/leader-map)
                  ("+" . md/font-size-incr)
                  ("-" . md/font-size-decr)
                  ("tx" . font-lock-mode)
                  ("x" . execute-extended-command) ; M-x
                  ("f" . find-file)
                  ("U" . undo-tree-visualize)
                  ("o" . md/insert-blank-line-before)

                  ("'o" . md/scratch-open-file-org)
                  ("'e" . md/scratch-open-file-elisp)

                  ("jf" . project-find-file)
                  ("jj" . project-switch-project)
                  ("jk" . project-kill-buffers)

                  ;; buffers
                  ("w" . save-buffer)
                  ("W" . md/strip-whitespace-and-save)
                  ("k" . kill-buffer)
                  ("bi" . md/file-info)
                  ("bk" . kill-buffer)
                  ("br" . read-only-mode)

                  ;; eval
                  ("ef" . eval-defun)
                  ("ee" . eval-last-sexp)
                  ("eb" . eval-buffer)
                  ("eE" . eval-expression)   ; in minibuffer
                  ("ex" . md/fontify-buffer)
                  (";m" . md/messages-toggle)

                  ;; Emacs
                  ("Ek" . kill-emacs)
                  ("Es" . server-start)
                  ("Ep" . list-processes)
                  ("Ed" . md/toggle-debug-on-error)

                  ;; Packages
                  ("Pi" . straight-use-package)
                  ("Pu" . package-update)
                  ("Pl" . package-list-packages)
                  ("Pr" . package-refresh-contents)

                  ;; Formatting
                  ("Fj" . json-pretty-print)
                  ("Fs" . sort-lines)
                  ("Fn" . md/expand-newlines)

                  ;; Toggle misc
                  ("tw" . toggle-truncate-lines)
                  ("tt" . md/load-theme)
                  ("tD" . md/toggle-window-dedicated)
                  ("t <tab>" . whitespace-mode)

                  ;; Help
                  ("h" . help-map))

            (:map (help-map)
                  ;; These seem natural as I use f/v a lot for viewing help
                  ;; on functions/variables
                  ("F" . find-function) ;; Overwrites info-goto but I never use that
                  ("V" . find-variable)
                  ("x" . describe-face)
                  ("X" . describe-text-properties)
                  ("K" . describe-personal-keybindings))))
#+end_src

