emacs.2023.symlink/init.el
  :if (eq system-type 'darwin)

  :config
  ;; If this isn't set then pasting via Alfred doesn't work
  (if (eq window-system 'ns)
      (global-set-key (kbd "M-v") 'evil-paste-after))

  :custom
  ;; Set alt/option to use its default behaviour in OS X , so I can do
  ;; eg. alt+3 to insert #. By default in Emacs this is Meta, but I find Meta more
  ;; accessible on the left cmd key.
  (ns-option-modifier nil)

  ;; This is the default, and seems to handle the standard cmd key
  ;; bindings, so apple cmd+c runs super+c in emacs, etc. I don't use them
  ;; much, but they might be useful sometimes.
  (ns-right-command-modifier 'super)

  ;; Instead of the cmd bindings (that I don't use much), use the left
  ;; cmd key for Meta bindings. This is easier to reach than the default Meta
  ;; key (which is alt).
  (ns-command-modifier 'meta))

(use-package undo-tree
  :demand t
  :custom
  (undo-tree-auto-save-history nil "Don't save undo tree history files everywhere")
  :config (global-undo-tree-mode 1))

(use-package key-chord
  :functions key-chord-mode
  :custom
  (key-chord-two-keys-delay 0.4 "Set key delay"))

(use-package use-package-chords
  :after (key-chord)
  :config (key-chord-mode 1)
  :demand t)

(use-package evil
  :demand t
  :after (undo-tree)

  :config
  (defun md/goto-definition-dwim ()
    (interactive)
    (evil-set-jump)
    (if (and
         (fboundp 'md/org-goto-ticket-at-point) ;; Will only be set when org loaded
         (string-match "^ORG-[0-9]+$" (thing-at-point 'symbol t)))
        (call-interactively 'md/org-goto-ticket-at-point)
      (call-interactively 'evil-goto-definition)))

  :md/bind ( ;; Like my vimrc, remap  ; to : and , to ;
            (:map (evil-motion-state-map)
                  (";" . evil-ex)
                  ("," . evil-repeat-find-char))
            ;; Like in the terminal. Mainly useful in minibuffer
            (:map (evil-insert-state-map)
                  ;; Use this instead of the default evil-complete-next, as
                  ;; completion-at-point integrates with consult etc. by default.
                  ("C-n" . completion-at-point)
                  ;; Emacs movement
                  ("C-a" . move-beginning-of-line)
                  ("C-e" . move-end-of-line))
            (:map (evil-visual-state-map)
                  ("SPC" . md/leader-map)
                  ("H" . move-beginning-of-line)
                  ("L" . move-beginning-of-line))
            ;; Various common bindings I use
            (:map (evil-normal-state-map)
                  ("H" . move-beginning-of-line)
                  ("L" . move-beginning-of-line)
                  ("(" . evil-previous-open-paren)
                  (")" . evil-next-close-paren)
                  ("j" . evil-next-visual-line)  ; equivalent of mapping to gj/gk
                  ("k" . evil-previous-visual-line)
                  ("M-j" . md/move-line-down)
                  ("M-k" . md/move-line-up)
                  ("M-h" . evil-shift-left-line)
                  ("M-l" . evil-shift-right-line)
                  ("C-l" . evil-jump-forward) ;; See setting below - we use this instead of vim's default C-i
                  ("gd" . md/goto-definition-dwim)
                  ("gD" . xref-find-references)  ;; Like the opposite to gd, which goes to definition
                  ("SPC" . md/leader-map))
            (:map (md/leader-map)
                  ("q" . md/evil-fill)
                  ("Q" . md/evil-unfill)
                  ("cc" . comment-or-uncomment-region)
                  ("y" . md/project-copy-visited-file-path))
            ;; The *Warnings* buffer loads in normal mode, and I want to be able to quit
            ;; it easily
            (:map (special-mode-map . normal)
                  ("q" . quit-window))
            ;; Help bindings
            (:map (help-mode-map . normal)
                  ("q" . quit-window)
                  ("C-i" . help-go-forward)
                  ("C-o" . help-go-back)
                  ("<RET>" . help-follow-symbol)))

  :chords
  (:map evil-insert-state-map
        ;; Easy way to leave normal state
        ("jj" . md/normal-state-and-save)
        ("jk" . evil-normal-state)
        :map evil-replace-state-map
        ("jj" . md/normal-state-and-save)
        ("jk" . evil-normal-state))

  :init
  (defun md/normal-state-and-save ()
    "I bind this to jj and use it to exit insert-state and save."
    (interactive)
    (evil-normal-state)
    (md/save-if-not-remote))

  (defun md/evil-fill (&optional start end)
    "A DWIM fill function for the highlighted region or current paragraph."
    (interactive
     (if (use-region-p)
         (list (region-beginning) (region-end))
       (list nil nil)))
    (if (string= evil-state "visual")
        (fill-region start end)
      (fill-paragraph)))

  (defun md/evil-unfill (&optional start end)
    "Opposite of md/evil-fill."
    (interactive
     (if (use-region-p)
         (list (region-beginning) (region-end))
       (list nil nil)))
    (if (string= evil-state "visual")
        (let ((fill-column most-positive-fixnum))
          (fill-region start end))
      (let ((fill-column most-positive-fixnum))
        (fill-paragraph))))

  (defun md/move-line-up ()
    "Move the current line up one row."
    (interactive)
    (let ((col (current-column))
          ;; For org-agenda I like that you can temporarily change order of items, so ignore readonly
          (inhibit-read-only (eq major-mode 'org-agenda-mode)))
      (transpose-lines 1)
      (forward-line -2)
      (evil-goto-column col)))

  (defun md/move-line-down ()
    "Move the current line down one row."
    (interactive)
    (let ((col (current-column))
          ;; For org-agenda I like that you can temporarily change order of items, so ignore readonly
          (inhibit-read-only (eq major-mode 'org-agenda-mode)))
      (forward-line 1)
      (transpose-lines 1)
      (forward-line -1)
      (evil-goto-column col)))

  ;; Don't jump forward using C-i - we want to insert a TAB instead. This also
  ;; fixes issue where enabling evil prevents TAB from cycling headings in org-mode.
  ;; Seems like this has to be set before loading evil.
  (setq evil-want-C-i-jump nil)

  :custom
  (evil-echo-state nil "Don't put insert/visual etc in minibuffer")
  (evil-goto-definition-functions
   '(evil-goto-definition-xref
     evil-goto-definition-imenu
     evil-goto-definition-semantic
     evil-goto-definition-search)
   "Prefer xref for jumping to definition, as this means we get the Eglot jump-to feature when enabled. By default this prefers imenu")

  :config
  ;; I keep accidentally quiting with :q. Just deleting the window is enough
  (evil-ex-define-cmd "q[uit]" 'evil-window-delete)

  ;; Evil's undo functionality should be undo-tree
  (evil-set-undo-system 'undo-tree)

  ;; Use vi keys to navigate help-mode
  (evil-set-initial-state 'help-mode 'normal)

  (evil-mode 1))

(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

(use-package emacs
  :after (evil)
  :init
  (defvar splitscreen/mode-map (make-sparse-keymap))
  (define-prefix-command 'splitscreen/prefix)
