emacs.2023.symlink/init.org
** Core vanilla org

Base org configuration that doesn't depend on evil.

#+begin_src emacs-lisp
(use-package org
  :init
  (defun md/org-timestamp-time-inactive-no-confirm ()
    "Insert inactive time timestamp without prompting the user"
    (interactive)
    (org-insert-time-stamp (current-time) t t))

  (defun md/org-timestamp-date-inactive-no-confirm ()
    "Insert inactive date timestamp without prompting the user"
    (interactive)
    (org-insert-time-stamp (current-time) nil t))

  (defun md/org-narrow-next ()
    "Show a narrowed view of the next org node in the buffer. Can be used to cycle through nodes one by one."
    (interactive)
    (when (org-buffer-narrowed-p)
      (widen))
    (call-interactively 'org-next-visible-heading)
    (org-narrow-to-subtree)
    (outline-hide-subtree)
    (org-show-entry)
    (org-show-children))

  (defun md/org-narrow-prev ()
    "Show a narrowed view of the previous org node in the buffer. Can be used to cycle through nodes one by one."
    (interactive)
    (when (org-buffer-narrowed-p)
      (widen))
    (call-interactively 'org-previous-visible-heading)
    (org-narrow-to-subtree)
    (outline-hide-subtree)
    (org-show-entry)
    (org-show-children))

  (defconst md/org-review-property "LAST_REVIEWED"
    "I use this in a few places to keep track of when I lasted reviewed particular headlines")

  (defun md/org-review ()
    "Set the LAST_REVIEWED property to the current date/time"
    (interactive)
    (org-set-property md/org-review-property ; currently this is LAST_REVIEWED
                      (with-temp-buffer
                        (org-insert-time-stamp (current-time) nil t)))) ; Inactive stamp

  (defun md/org-ticket ()
    "Insert a ticket number with the fixed prefix ORG in the format ORG-<num>.
Adds the ticket number to the selected heading and as a `TICKET` property.
If a `TICKET` property is already present, the function returns early."
    (interactive)
    (let ((prefix "ORG")
          (max-ticket-num 0)
          (new-ticket-num)
          (new-ticket))

      ;; Check if TICKET property already exists
      (if (org-entry-get nil "TICKET")
          (message "This item already has a TICKET property.")

        ;; Find the highest ticket number by looking at TICKET properties in the buffer
        (org-map-entries
         (lambda ()
           (let ((ticket (org-entry-get nil "TICKET")))
             (when (and ticket (string-match (concat "^" prefix "-\\([0-9]+\\)") ticket))
               (let ((num (string-to-number (match-string 1 ticket))))
                 (setq max-ticket-num (max max-ticket-num num))))))
         nil
         'agenda)

        ;; Increment the ticket number
        (setq new-ticket-num (1+ max-ticket-num))
        (setq new-ticket (format "%s-%d" prefix new-ticket-num))

        ;; Insert ticket at heading start if not already present
        (org-edit-headline
         (if (string-match (concat "^" prefix "-[0-9]+") (org-get-heading t t t t))
             (replace-match new-ticket nil nil (org-get-heading t t t t))
           (concat new-ticket " " (org-get-heading t t t t))))

        ;; Add TICKET property to the current entry
        (org-set-property "TICKET" new-ticket)

        ;; Feedback message
        (message "%s" new-ticket))))

  (defun md/org-goto-ticket-at-point ()
    "Go to the Org entry with a `TICKET` property matching the ticket ID at point.
The ticket ID at point should match the format ORG-<num> (e.g., ORG-1).
Searches across all Org agenda files."
    (interactive)
    (let* ((word
            ;; I was originally using thing-at-point, but I couldn't find a type
            ;; (like 'word or 'symbol) that consistently returned the current word
            ;; like vim would do with yiW -- in certain modes the dash character
            ;; would be used to terminate the thing. So instead we start by looking
            ;; at the whole line and figure it out from there. There must be a
            ;; simpler approach.
            (save-excursion
              (let ((line (thing-at-point 'line t)))
                (when (string-match "\\(ORG-[0-9]+\\)" line)
                  (let ((match-start (match-beginning 1))
                        (match-end (match-end 1)))
                    (let ((line-start (line-beginning-position)))
                      (setq match-start (+ line-start match-start))
                      (setq match-end (+ line-start match-end)))
                    (if (and (>= (point) match-start)
                             (< (point) match-end))
                        (message "%s" (match-string 1 line))
                      nil))))))
           (ticket-id (and word (string-match "^ORG-[0-9]+$" word) word))
           (found nil)
           (found-buffer nil)
           (found-point nil))

      (if (not ticket-id)
          (message "No valid ticket ID at point")
        ;; Search for the ticket in all agenda files
        (org-map-entries
         (lambda ()
           (when (string= (org-entry-get nil "TICKET") ticket-id)
             (setq found t)
             (setq found-buffer (current-buffer))
             (setq found-point (point))
             (org-show-entry) ;; Reveal entry in case it's folded
             (message "Found ticket ID %s" ticket-id)))
         (format "+TICKET=\"%s\"" ticket-id) ;; Match entries with TICKET property equal to ticket-id
         'agenda) ;; Search within all agenda files

        (if found-buffer
            (progn
              (switch-to-buffer found-buffer)
              (goto-char found-point))
          (message "Ticket ID %s not found" ticket-id)))))

  :config

  (defun md/org-link-sync ()
    "Sync an org-link to show the target headline as the contents.

When the cursor is on an org-link that uses the ID type, lookup the current state of the linked
headline, and replace the link contents with the current headline value.

For example, an \"outdated\" link like this:

    [[id:3C5473CB-3DCF-4A9B-9387-750730DAEB7B][My link contents description]]

Might be replaced by an up-to-date link like this:

    [[id:3C5473CB-3DCF-4A9B-9387-750730DAEB7B][DONE [#A] The current description of the headline]]"
    (interactive)
    (let* ((link-context (org-element-context))
           (type (org-element-property :type link-context))
           (path (org-element-property :path link-context))
           (point-begin (org-element-property :contents-begin link-context))
           (point-end (org-element-property :contents-end link-context)))
      (when (and path (equal type "id"))
        (let ((new-link-text
               (md/with-widened-buffer (md/find-file-buffer (org-id-find-id-file path))
                                       (save-window-excursion
                                         (org-open-at-point)
                                         (org-get-heading t nil nil nil)))))
          (goto-char point-begin)
          (delete-region point-begin point-end)
          (insert (format "%s" new-link-text)))
        (goto-char point-begin))))

  (defun md/org-ctrl-c-ctrl-c ()
    "I use this to add custom handlers and behaviour to C-c C-c.

For example, C-c- C-c is often used to update the state of org elements, and so
it feels like a natural way for me to call md/org-link-sync, because that
function updates the state of a ID link to be in sync with the target heading."
    (condition-case nil
        (let* ((link-context (org-element-context))
               (type (org-element-property :type link-context)))
          (cond
           ((and (eq (car link-context) 'link) (equal type "id"))
            (md/org-link-sync)
            t)  ; Returning t tells org-ctrl-c-ctrl-c that we did something
           (t nil)))  ; Tell org-ctrl-c-ctrl-c there was no match
      (error nil)))  ; Catch any errors in case org-element-context failed
  (add-hook 'org-ctrl-c-ctrl-c-hook 'md/org-ctrl-c-ctrl-c)

  (defun md/org-toggle-link-display ()
    "Call org-toggle-link-display and ensure any links in current buffer are redrawn.

By default, org-toggle-link-display does not force any kind of redraw of the
links in the buffer. AFAICT this /does/ happen by accident if you call it via
M-x - I don't know if that's universal by it does happen for me, I assume because
of the focus switch away from the original buffer to the vertico/helm buffer and then back."
    (interactive)
    (org-toggle-link-display)
    (org-restart-font-lock))

  (defadvice org-list-struct-fix-box (around ignore last activate)
    "Turn org-list-struct-fix-box into a no-op.

[2023-08-23]: By default, if an org list item is checked using the square-bracket
syntax [X], then org will look for a parent checkbox, and if all child items are
checked, it will set [X] on the parent too. This isn't how I personally use
child items -- I'll often use child checkboxes as subtasks, but it's almost
never an exhaustive list of everything that has to be done to close out the
parent -- and so I'd prefer to just control the parent checkbox state manually, or ideally to opt-in to this
behaviour by using a syntax similar to [/], which is used to show the count
of completed children.

AFAICT org-mode doesn't provide a way to customise this behaviour, /but/ the
behaviour all seems to be implemented in 'org-list-struct-fix-box'. And so I'm
trying something out by turning it into a no-op. It seems to work nicely initially,
but I won't be surprised if it causes an issue at some point because it's very
hacky."
    nil)

  ;; Another small org list / checkbox change here: add basic support for customising the
  ;; face for done '[X]' checkbox items.
  (defface md/org-checkbox-done-face
    '((t :height 0.9 :strike-through t))
    "Face for the done checkboxes.

AFAICT Org doesn't provide a way to customise the face used for done [X] checkboxes.
I use this face with a very basic regex to match done checkbox items, and apply the
face to the checkbox itself, so I can visually distinguish between done vs open items
more easily.

I think some properties will get overridden by org's actual font lock keywords, and
I haven't looked into that, but basic things like assigning strikethrough works ok,
and that's all I need."
    :group 'md/faces)

  (font-lock-add-keywords 'org-mode '(("- \\(\\[X\\]\\)" 1 'md/org-checkbox-done-face)))

  :md/bind ((:map (org-mode-map)
                  ("C-c d" . md/org-timestamp-date-inactive-no-confirm)
                  ("C-c t" . md/org-timestamp-time-inactive-no-confirm  )
                  ("C-c l" . md/org-insert-link-from-paste)
                  ("C-c L" . org-insert-last-stored-link)
                  ("C-c y" . org-store-link)
                  ("C-c C-y" . org-store-link)
                  ("C-c P" . org-priority-up)
                  ("C-c T" . org-todo)
                  ("C-c E" . org-set-effort)
                  ("C-c C-r" . md/org-review)
                  ("C-c C-i" . md/org-ticket)  ;; Overrides C-c C-tab on terminal but I don't use that
                  ("C-j" . md/org-narrow-next)
                  ("C-k" . md/org-narrow-prev))
            (:map (org-mode-map . normal)
                  ("C-j" . md/org-narrow-next)
                  ("C-k" . md/org-narrow-prev))
            (:map (global-map)
                  ("C-c c" . org-capture))
            (:map (md/leader-map)
                  ("a c" . org-capture)
                  ("RET" . org-capture)
                  ("a j" . org-clock-goto)
                  ("a i" . org-clock-in)
                  ("a o" . org-clock-out)
                  ("t l" . md/org-toggle-link-display)))

  :hook (
         ;; TODO - is this required or does it work by default?
         (org-mode . turn-on-auto-fill))

  :custom
  (org-src-window-setup 'current-window "When editing a src block, just use the current window instead of rearranging the frame")
  (org-indirect-buffer-display 'current-window "Similar to org-src-window-setup - I find this more intuitive")
  (org-edit-src-content-indentation 0 "Don't indent code in a src block. This way it's easier to edit inline in the org buffer")
  (org-startup-folded t "Don't expand org buffers on open")
  (org-log-done 'time "Add timestamp when set task as closed")
  (org-id-link-to-org-use-id 'create-if-interactive "Use :ID: values when calling org-store-link, instead of it storing a text-search link that can break easily")
  (org-level-color-stars-only nil "Colour the whole heading")
  (org-fontify-done-headline t "Colour done headings tomake them less prominent")
  (org-fold-catch-invisible-edits 'show-and-error "Try to prevent accidentally editing hidden lines")
  (org-adapt-indentation nil " Don't indent things for nested headings (eg. properties)")
  (org-clock-out-remove-zero-time-clocks t "Don't keep zero clocks")
  (org-ellipsis " " "Use utf-8 ellipsis character when an item has hidden content")
  (org-hide-emphasis-markers nil "Whether to show the markup characters for bold/underline/emphasis etc")
  (org-pretty-entities nil "I don't really use special characters and don't want them showing up accidentally")
  (org-fontify-quote-and-verse-blocks t)
  (org-image-actual-width 400 "Set width for images as their original size can be too big sometimes")
  (org-capture-bookmark nil "Don't create a bookmark to the last captured item")
  (org-M-RET-may-split-line nil "If I press M-RET I want a new line, not to split the line")
  (org-goto-interface 'outline-path-completion "For org-goto, use completion rather than the weird default interface where you search through the file")
  (org-outline-path-complete-in-steps nil "Search the whole path rather than having to select the top-level heading first then the children")
  (org-refile-use-outline-path t "When refiling, show the full path to the node rather than just the node name")
  (org-highest-priority 65 "Priority A")
  (org-lowest-priority 68 "Priority D")
  (org-default-priority 68 "Default to D")
  (org-log-into-drawer t "Put state transitions into the LOGBOOK drawer, instead of the main body of the item")
  (org-latex-default-packages-alist
   '(("AUTO" "inputenc" t
      ("pdflatex"))
     ("T1" "fontenc" t
      ("pdflatex"))
     ("" "graphicx" t)
     ("" "grffile" t)
     ("" "longtable" nil)
     ("" "wrapfig" nil)
     ("" "rotating" nil)
     ("normalem" "ulem" t)
     ("" "amsmath" t)
     ("" "textcomp" t)
     ("" "amssymb" t)
     ("" "capt-of" nil)
     ("linktoc=all,colorlinks=true,linkcolor=black,urlcolor=blue" "hyperref" nil))
   "Very similar to the original value - I think I've just added the href customisation "))
#+end_src

