emacs.2023.symlink/init.el
  (define-minor-mode md/evil-org-mode
    "Buffer local minor mode for evil-org"
    :init-value nil
    :lighter " EvilOrg"
    :keymap (make-sparse-keymap) ; defines md/evil-org-mode-map
    :group 'md/evil-org)

  (defun md/org-hook ()
    "Some behaviour overrides for org-mode"

    ;; Change tab widths to fit headline indents
    ;;
    ;; [2024-03-29] NOTE: since a recent org release lots of commands error if
    ;; tab width isn't set to 8. I previously had it as 2. Unsure implications of this.
    (setq tab-width 8
          evil-shift-width 2))

  (defun md/org-insert-link-from-paste ()
    "Perform org-insert-link with the current contents of the clipboard.

If a region is highlighted, then turn that region into a link using the
clipboard contents. Otherwise, prompt for a description"
    (interactive)
    ;; Region version - turn selected region into link
    (if (use-region-p)
        (let ((region-text (buffer-substring (region-beginning) (region-end))))
          (delete-region (region-beginning) (region-end))
          (org-insert-link
           nil
           (with-temp-buffer
             (evil-paste-after nil)
             (delete-trailing-whitespace)
             (buffer-string))
           region-text))

      ;; New link - prompt for description
      (org-insert-link
       nil
       (with-temp-buffer
         (evil-paste-after nil)
         (delete-trailing-whitespace)
         (buffer-string))
       (read-string "Description: "))))

  :md/bind ((:map (evil-insert-state-map)
                  ("C-c d" . md/org-timestamp-date-inactive-no-confirm)
                  ("C-c t" . md/org-timestamp-time-inactive-no-confirm))
            (:map (md/evil-org-mode-map . normal)
                  ("gk" . outline-previous-visible-heading)
                  ("gj" . outline-next-visible-heading)
                  ("gK" . md/org-narrow-prev)
                  ("gJ" . md/org-narrow-next)
                  ("H" . org-beginning-of-line)
                  ("L" . org-end-of-line)
                  ("$" . org-end-of-line)
                  ("^" . org-beginning-of-line)
                  ("-" . org-cycle-list-bullet)
                  ("RET" . org-cycle)
                  ("TAB" . org-cycle))
            (:map (md/evil-org-mode-map . (normal insert))
                  ("M-l" . org-metaright)
                  ("M-h" . org-metaleft)
                  ("M-k" . org-metaup)
                  ("M-j" . org-metadown)
                  ("M-L" . org-shiftmetaright)
                  ("M-H" . org-shiftmetaleft)
                  ("M-K" . org-shiftmetaup)
                  ("M-J" . org-shiftmetadown)
                  ("C-c u" . org-priority-up)))

  :hook ((org-mode . md/org-hook)
         (org-mode . md/evil-org-mode)))

(use-package org
  :after (evil)

  :init
  (define-minor-mode md/evil-org-agenda-mode
    "Buffer local minor mode for evil-org-agenda"
    :init-value nil
    :lighter " EvilOrgAgenda"
    :keymap (make-sparse-keymap) ; defines md/evil-org-agenda-mode-map
    :group 'md/evil-org-agenda)

  (defun md/org-agenda-todo ()
    "Wrap org-agenda-todo but always use the prefix. Saves me pressing C-u."
    (interactive)
    (setq current-prefix-arg '(4))  ; C-u
    (call-interactively 'org-agenda-todo))

  ;; Not strictly an org util - if I need it anywhere else I'll move it out.
  (defun md/advice-suppress-delete-other-windows (fn &rest args)
    "Hacky advice to fix something I don't like about org-agenda and org-capture.

When calling org-agenda, before the '*Agenda Commands*' buffer is switched to,
there's a manual call to (delete-other-windows). These windows are restored once
you've selected an agenda command, but I find it jarring to have my windows
temporarily disappear, and as the '*Agenda Commands*' buffer is quite small, it
isn't necessary to delete everything else on my screen. Org-capture has a
similar issue.

Unfortunately there's no clean way to prevent this behaviour. Eg. for org-agenda
it happens inside (org-agenda-get-restriction-and-command) with an inlined call
to (delete-other-windows). This is a quite a long function, and isn't something
that I want to inline and redefine myself. So instead we have this hacky
dual-advice approach: this advice will create temporary advice to turn
delete-other-windows into a no-op, and then restore once the org function has exited."
    (advice-add 'delete-other-windows :override
                'ignore
                '((name . "ignore")))
    (let ((result (condition-case nil
                      (apply fn args)
                    (t nil))))
      (advice-remove 'delete-other-windows "ignore")
      result))
  (advice-add 'org-agenda-get-restriction-and-command :around 'md/advice-suppress-delete-other-windows '((name . "ignore")))
  (advice-add 'org-capture :around 'md/advice-suppress-delete-other-windows '((name . "ignore")))

  :config
  ;; When org-agenda loads I want to be able to use j/k etc for navigation like any buffer.
  (evil-set-initial-state 'org-agenda-mode 'normal)

  :md/bind ((:map (global-map)
                  ("C-c a" . org-agenda))
            (:map (md/leader-map)
                  ("a a" . org-agenda)
                  ("TAB" . org-agenda))
            (:map (md/evil-org-agenda-mode-map . normal)
                  ;; Next/previous line
                  ("j" . org-agenda-next-line)
                  ("n" . org-agenda-next-line)
                  ("C-n" . org-agenda-next-line)
                  ("k" . org-agenda-previous-line)
                  ("p" . org-agenda-previous-line)
                  ("C-p" . org-agenda-previous-line)

                  ("TAB" . org-agenda-goto)  ; Goto selected item in other window
                  ("RET" . org-agenda-switch-to)  ; Replace agenda with this item
                  ("t" . md/org-agenda-todo)  ; Cycle todo state
                  ("P" . org-agenda-priority-up)
                  ("E" . org-agenda-set-effort)
                  ("R" . org-agenda-refile)
                  ("T" . org-agenda-set-tags)
                  ("C" . org-agenda-columns)

                  ;; Copy ID link to the heading
                  ("Y" . org-store-link)
                  ("C-c y" . org-store-link)
                  ("C-c C-y" . org-store-link)

                  ("]" . org-agenda-later)
                  ("[" . org-agenda-earlier)

                  ("q" . org-agenda-quit)
                  ("r" . org-agenda-redo)  ; Recalculate the agenda
                  ("v" . org-agenda-view-mode-dispatch)  ; Alter the view - toggle archived, logs, clocks etc.
                  ("\\" . org-agenda-filter-remove-all)  ; Remove existing filters
                  ("/" . org-agenda-filter-by-regexp)  ; Search
                  ("@" . org-agenda-filter)  ; Tag filter
                  ("'" . org-agenda-filter-by-category)  ; Show other items with same category as current
                  ("e" . org-agenda-filter-by-effort)
                  ("A" . org-agenda-append-agenda)))  ; Add another agenda

  :custom
  (org-agenda-restore-windows-after-quit nil "Whether to let org-agenda permanently mess with window layout")
  (org-agenda-window-setup 'current-window "The default of 'reorganize-frame reorganising all my windows in an annoying way. Using current-window makes it predictable")
  (org-agenda-sticky t "Cache org agenda until manually refreshed, to decrease wait times")

  :hook ((org-agenda-mode . md/evil-org-agenda-mode)))

(use-package ox
  :straight nil
  :custom
