emacs.2023.symlink/init.org
** org-fancy-priorities

This is a small library but I find it makes org priorities a lot more
useful. It's a similar idea to org-bullets but for priorities - you can swap how
the priorities for other characters. I configure this with my other org setup,
which I need to migrate into this file.

#+begin_src emacs-lisp
(use-package org-fancy-priorities)
#+end_src

** ox-rss

[2021-06-16] Ox-rss allows for publishing of a feed.xml RSS file. This is
useful, but has a big performance issue: it hangs for 30s+ running
~(indent-region)~ as part of prettifying the XML file.

To get around this, we redefine ~org-rss-final-function~ and skip the indenting
part. The resulting file still has appropriate newlines everywhere, they're just
not indented with leading whitespace, which is fine.

#+begin_src emacs-lisp
(use-package ox-rss
  :demand t
  :config
  (when (fboundp 'org-rss-final-function)
    (fmakunbound 'org-rss-final-function)
    (defun org-rss-final-function (contents backend info)
      "Prettify the RSS output. Copied from ox-rss, but doesn't call indent-region"
      (with-temp-buffer
        (xml-mode)
        (insert contents)
        ;;(indent-region (point-min) (point-max))
        (buffer-substring-no-properties (point-min) (point-max))))))
#+end_src

** [[https://github.com/alf/ob-restclient.el][ob-restclient]]

#+begin_src emacs-lisp
(use-package ob-restclient)
#+end_src

** TODO (tidy) [[https://github.com/mattduck/org-mind-map][org-mind-map]]
:PROPERTIES:
:OMM-COLOR: #AF7575
:END:

#+begin_src emacs-lisp
(use-package ox-org :demand t :straight nil)

(use-package org-mind-map
  :demand t
  ;; includes my fix https://github.com/the-humanities/org-mind-map/pull/52
  :straight (:host github :repo "mattduck/org-mind-map")
  :load-path "/f/dotfiles/../emacs.default/non-elpa/org-mind-map"

  :custom
  (org-mind-map-include-text nil)
  (org-mind-map-engine "dot")
  (org-mind-map-tag-colors 'nil)
  (org-mind-map-wrap-text-length 30)
  (org-mind-map-default-node-attribs '(("shape" . "plaintext")))
  (org-mind-map-default-edge-attribs '(("color" . "#cccccc")
                                       ("arrowhead" . "none")
                                       ("arrowtail" . "none")))
  (org-mind-map-default-graph-attribs '(("autosize" . "false")
                                        ("size" . "125,50")
                                        ("resolution" . "100")
                                        ("nodesep" . "0.4")
                                        ("margin" . "0.1")
                                        ("overlap" . "false")
                                        ("splines" . "ortho")
                                        ("rankdir" . "LR")))

  :config
  (defun md/org-mind-map-export ()
    "org-mind-map export with some tag/property replacement"
    (interactive)
    (let ((current-buffer-contents ;; either selected region or whole buffer
           (if (region-active-p)
               (buffer-substring (region-beginning) (region-end))
             (buffer-string)))
          (base-filename  ;; if can't detect filename, prompt for it
           (file-name-sans-extension
            (file-name-sans-extension
             (if buffer-file-name buffer-file-name
               (completing-read "filename: " (directory-files "."))))))
          (buffer-offset 0))
      (with-temp-buffer
        (insert current-buffer-contents)
        (goto-char (point-min))
        (org-mode)
        (org-align-all-tags)
        (org-element-map (org-element-parse-buffer 'object nil) 'headline
          (lambda (elem)
            (goto-char (+ (org-element-property :begin elem) buffer-offset))
            (let ((first-tag (car (org-get-tags nil t)))
                  (elem-buffer-size (buffer-size))
                  (elem-offset 0))
              (cond ((string= first-tag "red") (org-set-property "OMM-COLOR" "#AF7575"))
                    ((string= first-tag "amber") (org-set-property "OMM-COLOR" "#EFD8A1"))
                    ((string= first-tag "green") (org-set-property "OMM-COLOR" "#BCD693"))
                    ((string= first-tag "blue") (org-set-property "OMM-COLOR" "#AFD7DB"))
                    (t nil))
              (org-set-tags "")
              ;; Offset is used to account for the fact that we have added/removed characters,
              ;; so the old :begin value will be wrong.
              (setq elem-offset (- (buffer-size) elem-buffer-size))
              (setq buffer-offset (+ buffer-offset elem-offset)))))
        (org-mind-map-write-named (concat base-filename ".mind-map") (concat base-filename ".mind-map.dot") t)))))
#+end_src

* [[https://github.com/Fanael/edit-indirect/blob/master/edit-indirect.el][Edit-indirect]]

[2023-06-03] This provides a function to edit a selected region in an indirect
buffer. I don't use it that often but I can use it to do things like opening up
inline sql strings in sql mode.

#+begin_src emacs-lisp
(use-package edit-indirect)
#+end_src

I'm not sure why I didn't use built-in indirect edit features for this, maybe
something to do with this section of the docs:

#+begin_quote
This differs from `clone-indirect-buffer' with narrowing in that
the text properties are not shared, so the parent buffer major mode
and the edit-indirect buffer major mode will not be able to tread
on each other's toes by setting up potentially conflicting text
properties, which happens surprisingly often when the font-lock
mode is used.
#+end_quote

* Narrowing

Add a narrow/widen dwim command, inspired by
http://endlessparentheses.com/emacs-narrow-or-widen-dwim.html:

[2023-06-03] This could do with some tidying - I want 1 or 2 entry functions
rather than 4.

#+BEGIN_SRC emacs-lisp
(use-package emacs
  :demand t
  :after (org edit-indirect)
  :config
  ;; Don't ask for confirmation on narrow-to-region
  (put 'narrow-to-region 'disabled nil)

  (defvar md/narrow-dwim-enable-org-clock nil
    "When true, md/narrow-dwim will start/stop the clock for narrowed org subtrees")

  (defun md/narrow-dwim (p)
    "Widen if buffer is narrowed, narrow-dwim otherwise.
  Dwim means: region, org-src-block, org-subtree, or
  defun, whichever applies first. Narrowing to
  org-src-block actually calls `org-edit-src-code'.

  With prefix P, don't widen, just narrow even if buffer
  is already narrowed."
    (interactive "P")
    (declare (interactive-only))
    (cond ((and (buffer-narrowed-p) (not p))
           (progn
             (when
                 (and md/narrow-dwim-enable-org-clock
                      (string= major-mode "org-mode")
                      (org-clock-is-active))
               (org-clock-out nil t))
             (widen)))
          ((region-active-p)
           (edit-indirect-region (region-beginning) (region-end) t))
          (edit-indirect--overlay
           (edit-indirect-commit))
          (org-src-mode
           (org-edit-src-exit))
          ((derived-mode-p 'org-mode)
           (cond ((ignore-errors (org-edit-src-code) t))
                 ((ignore-errors (org-narrow-to-block) t))
                 (t (progn
                      (org-narrow-to-subtree)
                      (when (and md/narrow-dwim-enable-org-clock
                                 (not (org-clock-is-active)))
                        (org-clock-in))))))
          ((derived-mode-p 'latex-mode)
           (LaTeX-narrow-to-environment))
          ((derived-mode-p 'restclient-mode)
           (restclient-narrow-to-current))
          (t (narrow-to-defun))))

  (defun md/narrow-to-region-indirect (start end)
    "Restrict editing in this buffer to the current region, indirectly."
    (interactive "r")
    (deactivate-mark)
    (let ((buf (clone-indirect-buffer nil nil)))
      (with-current-buffer buf
        (narrow-to-region start end))
      (switch-to-buffer buf)))

  :md/bind ((:map (md/leader-map)
                  ("n" . narrow-map))
            (:map (narrow-map)
                  ;; Not strictly narrowing, but related
                  ("F" . org-babel-pop-to-session)
                  ("i" . org-tree-to-indirect-buffer)

                  ("v" . md/narrow-to-region-indirect)
                  ("f" . md/narrow-dwim)
                  ("r" . narrow-to-region))))
#+END_SRC

* [[https://github.com/minad/vertico][Vertico]] and friends

[2023-06-03] I'm trying these out as a replacement for Helm. My understanding of
the division between these packages is:

- Vertico :: Vertical completion UI.

- Orderless :: Provides the "completion style", ie. how the string matching
  works.

- Marginalia :: Provides text annotations in the minibuffer, eg. for
  ~describe-variable~ this shows the value of the variable and the first
  characters of its docstring. This also shows various buffer info like the
  visited filename and major mode.

- Consult :: Provides various features that make use of ~completing-read~, eg. a
  buffer-selection command similar to ~helm-mini~, search interfaces, jumping to
  files, Emacs theme selection etc.

Put together you get something more modular than Helm, which is the main tool
I've used previously for this kind of fzf selection feature.

