emacs.2023.symlink/init.el

(use-package vertico
  :demand t
  :after (evil)
  :custom
  (vertico-count 7 "Items displayed, defaults to 10")
  :config
  (vertico-mode 1)
  :md/bind ((:map (vertico-map)
              ;; Make C-l and C-j behave similar to what I'm used to from my Helm setup
              ("C-l" . vertico-insert)
              ("C-j" . evil-delete-backward-word)
              ;; If the output is grouped, I can use this to cycle the groups. This is easier
              ;; than using consult narrowing.
              ("C-k" . vertico-next-group))))

(use-package orderless
  :demand t
  :custom
  (completion-styles '(orderless basic) "Use orderless but fall back to Emacs' 'basic' completion if it doesn't work")
  (completion-category-overrides '((file (styles basic partial-completion))) "Orderless docs recommend this for handling Tramp properly."))

(use-package marginalia
  :init

  (defun md/marginalia-annotate-buffer (cand)
    "My version of annotations for buffers. Includeds the project name, which for
some reason marginalia doesn't do by default."
    (when-let (buffer (get-buffer cand))
      (let ((project-name (when-let ((project (project-current nil (buffer-local-value 'default-directory buffer))))
                            (file-name-nondirectory (directory-file-name (project-root project))))))
        (marginalia--fields
         (project-name :face 'marginalia-symbol :truncate 30)
         ((marginalia--buffer-status buffer))
         ((marginalia--buffer-file buffer) :truncate -0.5 :face 'marginalia-file-name)))))

  :config
  (add-to-list 'marginalia-annotator-registry
               '(buffer md/marginalia-annotate-buffer builtin none))
  (marginalia-mode 1)
  :custom
  (marginalia-field-width 160 "Increase the width from 80 to see more info"))

(use-package consult
  :after (evil)
  :init
