emacs.2023.symlink/init.org
*** [[https://github.com/minad/consult][Consult]]

Consult provides various features that make use of ~completing-read~. For
example, a buffer-switching command similar to

#+begin_src emacs-lisp
(use-package consult
  :after (evil)
  :init
  (defun md/list-applications ()
    "List applications installed in /usr/share. Linux only."
    (-map
     (lambda (item)
       (s-chop-suffix ".desktop" item))
     (-filter (lambda (d) (not (or (string= d ".") (string= d ".."))))
              (directory-files "/usr/share/applications"))))

  (defun md/gtk-launch (program-name)
    "Use gtk-launch to run a program."
    (shell-command (concat "gtk-launch " program-name " >/dev/null 2>&1 & disown") nil nil))

  (defun md/consult-launch ()
    "Alfred-like task launcher - type the program name and run it from within
    Emacs. I use this to start programs with exwm."
    (interactive)
    (consult--read
     (md/list-applications)
     :category 'md/program
     :prompt "Program: "
     :state (lambda (action cand)
              (when (and cand (eq action 'return))
                (md/gtk-launch cand)))))

  ;; [2024-02-28] Use consult to improve C-o -- taken from
  ;; https://github.com/emacs-evil/evil-collection/blob/master/modes/consult/evil-collection-consult.el
  (defun evil-collection-consult-jump-list ()
    "Jump to a position in the evil jump list."
    (interactive)
    (consult-global-mark
     (delq nil (mapcar (lambda (jump)
                         (let ((mark (car jump)))
                           (when (markerp mark)
                             mark)))
                       (ring-elements (evil--jumps-get-window-jump-list))))))

  (defun md/consult-diff-hunks-git-command (git-command-string)
    "Use consult read to jump between all current diff hunks with preview. Disclaimer -- seems to work but written quickly with GPT."
    (let* ((vertico-sort-function nil)
           (git-root (vc-root-dir))
           (diff-output (shell-command-to-string git-command-string))
           (lines (split-string diff-output "\n" t))  ; `t` to omit null strings from results
           (current-file "")
           (hunks '()))
      ;; Parse diff output to extract file names and hunks
      (dolist (line lines)
        (cond ((string-match "^diff --git a/\\(.*\\) b/\\(.*\\)" line)
               (setq current-file (expand-file-name (match-string 2 line) git-root)))
              ((string-match "^@@ -\\([0-9]+\\),?\\([0-9]*\\) \\+\\([0-9]+\\),?\\([0-9]*\\) @@\\(.*\\)" line)
               (let* ((line-number (match-string 3 line))
                      (deleted (if (> (length (match-string 2 line)) 0)
                                   (string-to-number (match-string 2 line))
                                 (if (equal (match-string 2 line) "") 1 0)))
                      (added (if (> (length (match-string 4 line)) 0)
                                 (string-to-number (match-string 4 line))
                               (if (equal (match-string 4 line) "") 1 0)))
                      (change-type (cond ((and (> added 0) (> deleted 0)) 'diff-changed)
                                         ((> added 0) 'diff-added)
                                         ((> deleted 0) 'diff-removed)
                                         (t 'diff-changed)))  ; Default to 'diff-changed' for any other unforeseen cases
                      (rest-of-line (match-string 5 line))
                      (formatted-line (format "%s:%s%s%s" current-file line-number
                                              (if (> added 0) (format " +%d" added) "")
                                              (if (> deleted 0) (format " -%d" deleted) ""))))
                 (put-text-property 0 (length formatted-line) 'face change-type formatted-line)
                 (setq hunks (append hunks
                                     (list (cons (format "%s %s" formatted-line rest-of-line)
                                                 (cons current-file (string-to-number line-number))))))))))
      ;; Use consult to select and navigate to hunks
      (if hunks
          (consult--read hunks
                         :prompt "Select hunk: "
                         :lookup #'consult--lookup-cdr
                         :category 'file
                         ;; If transform if t then this must return the item. If nil,
                         ;; must return the group name. We naively just split on a colon
                         ;; character, assuming it won't be included in the file path.
                         :group (lambda (cand transform)
                                  (if transform
                                      (mapconcat 'identity (cdr (split-string cand ":" t)) ":")
                                    (car (split-string cand ":"))))
                         :state (lambda (action entry)
                                  (when entry
                                    (let ((file (car entry))
                                          (line-number (cdr entry)))
                                      (find-file file)
                                      (goto-char (point-min))
                                      (forward-line (1- line-number))
                                      (recenter-top-bottom 10)
                                      ;; Don't popup the hunk if it's added as I can see that from the buffer contents
                                      (when (and git-gutter-mode
                                                 (not (eq (git-gutter-hunk-type
                                                           (git-gutter:search-here-diffinfo git-gutter:diffinfos))
                                                          'added)))
                                        (condition-case nil
                                            ;; Popup in buffer overlay
                                            (md/with-display-buffer-alist
                                             '("*\\(git-gutter:diff\\)"
                                               (md/display-buffer-in-overlay-margin))
                                            (call-interactively 'git-gutter:popup-hunk))
                                          (error nil)))))
                                      ;; Kill windows when done
                                      (when (eq action 'return)
                                        (quit-windows-on git-gutter:popup-buffer))
                                      ))))
        (message "No matches"))

  (defun md/consult-diff-hunks ()
    (interactive)
    (md/consult-diff-hunks-git-command "git diff --no-color -U0"))

  (defun md/consult-diff-cached-hunks ()
    (interactive)
    (md/consult-diff-hunks-git-command "git diff --no-color -U0 --cached"))

  (defun md/consult-ripgrep-dwim ()
    "Wrapper around consult-ripgrep, supporting a couple of different call modes.

project: search the project.

dir: search only the current directory.

python packages: choose a python module directory or file, and search within that. This is useful
as I don't see a way to reliably/efficiently achieve the same thing with pyright.

consult-line-multi: call consult-line-multi to search all open project buffers"
    (interactive)
    (let* ((choices '("project" "dir" "python packages" "consult-line-multi"))
           (selection (completing-read "Select ripgrep type: " choices nil t)))
      (pcase selection
        ("project" (consult-ripgrep))  ;; Run consult-ripgrep with default project scope
        ("dir" (consult-ripgrep default-directory))  ;; Run consult-ripgrep in the current directory
        ("consult-line-multi" (call-interactively 'consult-line-multi))
        ("python packages"
         (let* ((packages (md/find-python-packages))
                (selected (completing-read "Select python package: " packages nil t)))
           (cond
            ((and selected (file-directory-p selected))
             ;; Directories can be passed straight to ripgrep
             (let ((consult-ripgrep-args (concat consult-ripgrep-args " --no-ignore")))
               (consult-ripgrep selected)))  ;; Run consult-ripgrep in the selected package directory
            ;; Files need to be passed as a list
            ((and selected (file-exists-p selected))
             (consult-ripgrep (list (shell-quote-argument selected))))  ;; Run consult-ripgrep on the single file
            (t
             (message "Selected item does not exist or is not accessible"))))))))

  (defun md/consult-find-dwim ()
    "Like md/consult-ripgrep-dwim, but the actions are finding files rather than grepping"
    (interactive)
    (let* ((choices '("project" "dir" "python packages"))
           (selection (completing-read "Select find type: " choices nil t)))
      (pcase selection
        ("project" (project-find-file))
        ("dir"
         (let ((consult-fd-args (append consult-fd-args '("--no-ignore"))))
           (consult-fd default-directory)))
        ("python packages"
         (let* ((packages (md/find-python-packages))
                (selected (completing-read "Select python package: " packages nil t)))
           (cond
            ((and selected (file-directory-p selected))
             ;; Directories can be passed straight to fd
             (let ((consult-fd-args (append consult-fd-args '("--no-ignore"))))
               (consult-fd selected)))
            ;; Files are already files, so open them
            ((and selected (file-exists-p selected))
             (find-file selected))
            (t
             (message "Selected item does not exist or is not accessible"))))))))

  :config
  (consult-customize
   ;; Disable preview when switching buffers
   consult-buffer :preview-key nil)

  ;; Populate an initial value for consult-line, as this doesn't happen by default
  ;; consult-line :initial (thing-at-point 'symbol))
  :md/bind ((:map (md/leader-map)
                  ("gd" . md/consult-diff-hunks)
                  ("gc" . md/consult-diff-cached-hunks)
                  ("p" . consult-buffer)
                  ("jp" . consult-project-buffer)  ; project-file-file just works by default, this is separate
                  ("jF" . md/consult-find-dwim)  ;; Search packages and other places
                  ("/" . consult-line)
                  ("j/" . md/consult-ripgrep-dwim)  ;; I have a few different uses for consult-ripgrep
                  ("j." . xref-find-apropos)
                  ("." . consult-imenu)) ; See eglot section for consult-eglot-symbols, bound to j.
            (:map (global-map . normal)
                  ("C-o" . evil-collection-consult-jump-list))
            (:map (consult-narrow-map)
                  ;; This shows the support "narrow" keys for this completion
                  ("?" . consult-narrow-help)))

  :custom
  (completion-in-region-function #'consult-completion-in-region "Use consult for completion")
  (xref-show-xrefs-function #'consult-xref "Use consult to show xrefs, ie. when looking for references to a symbol")
  (xref-show-definitions-function #'consult-xref "Use consult to select xref definitions when there are more than one")
  (consult-narrow-key "<" "Used to narrow results to a particular type, eg. functions, files")
  (consult-async-min-input 1 "Run async commands like consult-eglot-symbols sooner than the default of 3 keys"))
#+end_src

