emacs.2023.symlink/init.org
* [[https://elpa.gnu.org/packages/xclip.html][xclip]]

Terminal Emacs doesn't integrate with the system clipboard by default. ~xclip~
provides this behaviour in the same way that GUI Emacs has it. Turn it on even
if on GUI as might connect as client to terminal.

#+BEGIN_SRC emacs-lisp
(use-package xclip
  :config
  (xclip-mode 1))
#+END_SRC

* [[https://github.com/Wilfred/helpful][helpful]]

This provides some better alternative implementations of standard help functions
like ~describe-variable~, showing additional info like source code
implementation, keybindings, links to find usage. It also provides some new
commands like ~helpful-macro~.

#+begin_src emacs-lisp
(use-package helpful
  :after (eldoc evil)
  :init
  (defun md/help-at-point-dwim ()
    "Open help buffer for the thing at point.

In some modes, the best thing we have will be the eglot symbol hover for its
eldoc integration. For emacs-lisp mode we use the helpful-at-point function."
    (interactive)
    (cond ((eq major-mode 'emacs-lisp-mode)
           (call-interactively 'helpful-at-point))
          ((eglot-current-server)
           (md/eglot-helpful))
          (t
           (call-interactively 'eldoc)
           (switch-to-buffer (eldoc-doc-buffer)))))

  :md/bind ((:map (help-map)
                  ("v" . helpful-variable)
                  ("f" . helpful-function)
                  ("k" . helpful-key)
                  ("c" . helpful-command)
                  ("m" . helpful-macro)
                  ("M" . describe-mode))  ; This is "m" by default.
            (:map (evil-normal-state-map)
                  ("gh" . md/help-at-point-dwim))
            (:map (helpful-mode-map . normal)
                  ("q" . md/quit-and-kill-window))))
#+end_src
* [[https://github.com/Fuco1/free-keys][free-keys]]
List unused keys in current buffer.

#+begin_src emacs-lisp
(use-package free-keys
  :md/bind ((:map (help-map)
               ("@" . free-keys))))
#+end_src

* [[https://github.com/wasamasa/eyebrowse][eyebrowse]]

This is a lightweight tool providing window tabs/workspaces. I use it in a
similar way to vim tabs.

#+begin_src emacs-lisp
(use-package eyebrowse
  :demand t

  :init
  (defvar splitscreen/zoomed-p nil)
  (defun splitscreen/toggle-zoom ()
    "Toggle buffer-maximising within this eyebrowse tab. Replicates the
   tmux zoom feature that expands a single pane."
    (interactive)
    (if (= 1 (length (window-list)))
        (when (and (get-register (eyebrowse--get 'current-slot))
                   splitscreen/zoomed-p)
          (progn
            (setq-local splitscreen/zoomed-p nil)
            (jump-to-register (eyebrowse--get 'current-slot))))
      (progn
        (window-configuration-to-register (eyebrowse--get 'current-slot))
        (setq-local splitscreen/zoomed-p t)
        (delete-other-windows))))

  (defun splitscreen/reset-zoom (fn &rest args)
    "Ensure when a slot is closed, we forget the zoom for that slot."
    (apply fn args)
    (set-register (eyebrowse--get 'current-slot) nil))

  (defun md/eyebrowse-status (fn &rest args)
    "Advice for eyebrowse functions, to message the current eyebrowse status
in the echo area. I prefer to this putting it in the mode-line, because eyebrowse is a
slot/window-level thing, not buffer-level."
    (apply fn args)
    (message (format "%s" (eyebrowse-mode-line-indicator))))

  :custom
  (eyebrowse-wrap-around t "Allow cycling forever")
  (eyebrowse-mode-line-separator " " "Use space instead of comma in the mode-line")
  (eyebrowse-mode-line-left-delimiter "" "Remove the square brackets in the mode-line")
  (eyebrowse-mode-line-right-delimiter "" "Remove the square brackets in the mode-line")
  (eyebrowse-mode-line-style t "Always show this in the mode line (Although, I modify the mode-line separately so this is redundant unless I disable that)")
  (eyebrowse-new-workspace t "The new workspace should show the scratch buffer initally")

  :md/bind ((:map (splitscreen/prefix)
                  ("c" . eyebrowse-create-window-config)
                  ("n" . eyebrowse-next-window-config)
                  ("p" . eyebrowse-prev-window-config)
                  ("X" . eyebrowse-close-window-config)
                  ("o" . splitscreen/toggle-zoom)))
  :config

  ;; Add advice to handle my zoom feature with eyebrose
  (advice-add 'eyebrowse-close-window-config :around 'splitscreen/reset-zoom '((name . "splitscreen")))

  ;; Add advice to show status in echo area when I change eyebrowse state
  (advice-add 'eyebrowse-next-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))
  (advice-add 'eyebrowse-prev-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))
  (advice-add 'eyebrowse-close-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))
  (advice-add 'eyebrowse-create-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))

  (eyebrowse-mode 1))
#+end_src

* [[https://github.com/akermu/emacs-libvterm][vterm]]

Vterm is the most useful terminal emulator I've come across for emacs - it
performs a lot better than term/ansi-term.

#+begin_src emacs-lisp
(use-package vterm
  :demand t
  :after (evil)
  :init
  (defun md/vterm-mode-hook ()
    "Remove the margins for more efficient side-window display"
    (evil-emacs-state)
    (setq left-margin-width 0)
    (set-window-buffer (selected-window) (current-buffer)))

  (defun md/run-in-vterm-buffer (buffer-name command)
    "Run the given command in the given buffer. Ideally this would
also return the output of the command but for long-running stuff
that gets complicated"
    (with-current-buffer buffer-name
      (vterm-send-C-u)
      (sleep-for 0 200) ;; allow line to clear
      (vterm-send-string command)
      (vterm-send-return)))

  (defun md/vterm-command ()
    "Prompt for a command and run it in my default vterm buffer"
    (interactive)
    (let ((shell-command (read-string "$ " nil 'md/vterm-history))
          (vterm-buffer (get-buffer "*vterm*")))
      (switch-to-buffer vterm-buffer)
      (evil-normal-state)
      (md/run-in-vterm-buffer "*vterm*" shell-command)))

  (defun md/vterm-toggle ()
    "Display or start a vterm buffer, or hide it if it's already visible."
    (interactive)
    (let ((vterm-buffer (get-buffer "*vterm*")))
      (if vterm-buffer
          (if (get-buffer-window vterm-buffer)
              (delete-window (get-buffer-window vterm-buffer))
            (progn
              (switch-to-buffer vterm-buffer)
              ;; Go to normal state so it's easy to read the buffer and close it
              (evil-normal-state)))
        (vterm))))

  :config
  (evil-set-initial-state 'vterm-mode 'emacs)
  :hook ((vterm-mode . md/vterm-mode-hook))
  :md/bind ((:map (md/leader-map)
                  (";v" . md/vterm-toggle)
                  (";V" . md/vterm-command))
            (:map (vterm-mode-map)
                  ("C-<SPC>" . md/leader-map)
                  ("C-w" . splitscreen/prefix)
                  ("C-g" . vterm--self-insert))
            (:map (vterm-mode-map . normal)
                  ("q" . quit-window)
                  ("gk" . vterm-previous-prompt)
                  ("gj" . vterm-next-prompt)))
  :custom
  (vterm-max-scrollback 10000)
  (vterm-buffer-name-string "vterm [%s]"))
#+end_src

