emacs.2023.symlink/init.el

(use-package xclip
  :config
  (xclip-mode 1))

(use-package helpful
  :after (eldoc evil)
  :init
  (defun md/help-at-point-dwim ()
    "Open help buffer for the thing at point.

In some modes, the best thing we have will be the eglot symbol hover for its
eldoc integration. For emacs-lisp mode we use the helpful-at-point function."
    (interactive)
    (cond ((eq major-mode 'emacs-lisp-mode)
           (call-interactively 'helpful-at-point))
          ((eglot-current-server)
           (md/eglot-helpful))
          (t
           (call-interactively 'eldoc)
           (switch-to-buffer (eldoc-doc-buffer)))))

  :md/bind ((:map (help-map)
                  ("v" . helpful-variable)
                  ("f" . helpful-function)
                  ("k" . helpful-key)
                  ("c" . helpful-command)
                  ("m" . helpful-macro)
                  ("M" . describe-mode))  ; This is "m" by default.
            (:map (evil-normal-state-map)
                  ("gh" . md/help-at-point-dwim))
            (:map (helpful-mode-map . normal)
                  ("q" . md/quit-and-kill-window))))

(use-package free-keys
  :md/bind ((:map (help-map)
               ("@" . free-keys))))

(use-package eyebrowse
  :demand t

  :init
  (defvar splitscreen/zoomed-p nil)
  (defun splitscreen/toggle-zoom ()
    "Toggle buffer-maximising within this eyebrowse tab. Replicates the
   tmux zoom feature that expands a single pane."
    (interactive)
    (if (= 1 (length (window-list)))
        (when (and (get-register (eyebrowse--get 'current-slot))
                   splitscreen/zoomed-p)
          (progn
            (setq-local splitscreen/zoomed-p nil)
            (jump-to-register (eyebrowse--get 'current-slot))))
      (progn
        (window-configuration-to-register (eyebrowse--get 'current-slot))
        (setq-local splitscreen/zoomed-p t)
        (delete-other-windows))))

  (defun splitscreen/reset-zoom (fn &rest args)
    "Ensure when a slot is closed, we forget the zoom for that slot."
    (apply fn args)
    (set-register (eyebrowse--get 'current-slot) nil))

  (defun md/eyebrowse-status (fn &rest args)
    "Advice for eyebrowse functions, to message the current eyebrowse status
in the echo area. I prefer to this putting it in the mode-line, because eyebrowse is a
slot/window-level thing, not buffer-level."
    (apply fn args)
    (message (format "%s" (eyebrowse-mode-line-indicator))))

  :custom
  (eyebrowse-wrap-around t "Allow cycling forever")
  (eyebrowse-mode-line-separator " " "Use space instead of comma in the mode-line")
  (eyebrowse-mode-line-left-delimiter "" "Remove the square brackets in the mode-line")
  (eyebrowse-mode-line-right-delimiter "" "Remove the square brackets in the mode-line")
  (eyebrowse-mode-line-style t "Always show this in the mode line (Although, I modify the mode-line separately so this is redundant unless I disable that)")
  (eyebrowse-new-workspace t "The new workspace should show the scratch buffer initally")

  :md/bind ((:map (splitscreen/prefix)
                  ("c" . eyebrowse-create-window-config)
                  ("n" . eyebrowse-next-window-config)
                  ("p" . eyebrowse-prev-window-config)
                  ("X" . eyebrowse-close-window-config)
                  ("o" . splitscreen/toggle-zoom)))
  :config

  ;; Add advice to handle my zoom feature with eyebrose
  (advice-add 'eyebrowse-close-window-config :around 'splitscreen/reset-zoom '((name . "splitscreen")))

  ;; Add advice to show status in echo area when I change eyebrowse state
  (advice-add 'eyebrowse-next-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))
  (advice-add 'eyebrowse-prev-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))
  (advice-add 'eyebrowse-close-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))
  (advice-add 'eyebrowse-create-window-config :around 'md/eyebrowse-status '((name . "md/eyebrowse-status")))

  (eyebrowse-mode 1))

(use-package vterm
  :demand t
  :after (evil)
  :init
  (defun md/vterm-mode-hook ()
    "Remove the margins for more efficient side-window display"
    (evil-emacs-state)
    (setq left-margin-width 0)
    (set-window-buffer (selected-window) (current-buffer)))

  (defun md/vterm-toggle ()
    "Display or start a vterm buffer, or hide it if it's already visible."
    (interactive)
    (let ((vterm-buffer (get-buffer "*vterm*")))
      (if vterm-buffer
          (if (get-buffer-window vterm-buffer)
              (delete-window (get-buffer-window vterm-buffer))
            (switch-to-buffer vterm-buffer))
        (vterm))))

  :config
  (evil-set-initial-state 'vterm-mode 'emacs)
  :hook ((vterm-mode . md/vterm-mode-hook))
  :md/bind ((:map (md/leader-map)
                  (";v" . md/vterm-toggle))
            (:map (vterm-mode-map)
                  ("C-<SPC>" . md/leader-map)
                  ("C-w" . splitscreen/prefix)
                  ("C-g" . vterm--self-insert))
            (:map (vterm-mode-map . normal)
                  ("gk" . vterm-previous-prompt)
                  ("gj" . vterm-next-prompt)))
  :custom
  (vterm-max-scrollback 10000)
  (vterm-buffer-name-string "vterm [%s]"))
