emacs.2023.symlink/init.org
* [[https://github.com/skeeto/elfeed][Elfeed]]

Elfeed is a lightweight RSS reader. I keep my list of feeds separately but this
is the main configuration.

#+begin_src emacs-lisp
(use-package elfeed
  :after (evil)

  :init
  (defun md/elfeed-search-toggle-unread ()
    (interactive)
    (elfeed-search-toggle-all 'unread))

  (defun md/elfeed-search-toggle-hide ()
    (interactive)
    (elfeed-search-toggle-all 'hidden))

  (defun md/elfeed-search-toggle-starred ()
    (interactive)
    (elfeed-search-toggle-all 'starred))

  :config
  ;; Automatically remove the "unread" flag from anything older than 1 month
  (add-hook 'elfeed-new-entry-hook
            (elfeed-make-tagger :before "1 month ago"
                                :remove 'unread))

  ;; Default to emacs state so I can override bindings
  (evil-set-initial-state 'elfeed-search-mode 'emacs)
  (md/make-keymap-noop elfeed-search-mode-map)
  (evil-set-initial-state 'elfeed-show-mode 'emacs)
  (md/make-keymap-noop elfeed-show-mode-map)

  :custom
  (elfeed-search-title-max-width 110 "Truncate title width")
  (elfeed-search-filter "@2-weeks-ago -hidden !ojwtech" "Default search filter")

  :md/bind ((:map (md/leader-map)
                  ("R" . elfeed))

            (:map (elfeed-search-mode-map)
                  ("SPC" . md/leader-map)
                  ("C-h" . help-mode-map)
                  ("q" . elfeed-search-quit-window)
                  ("j" . evil-next-visual-line)
                  ("n" . evil-next-visual-line)
                  ("C-n" . evil-next-visual-line)
                  ("k" . evil-previous-visual-line)
                  ("p" . evil-previous-visual-line)
                  ("C-p" . evil-previous-visual-line)
                  ("C-f" . evil-scroll-page-down)
                  ("C-b" . evil-scroll-page-up)
                  ("C-d" . evil-scroll-down)
                  ("l" . elfeed-search-show-entry)
                  ("o" . elfeed-search-browse-url)
                  ("r" . elfeed-search-update--force)
                  ("R" . elfeed-search-fetch)
                  ("|" . elfeed-search-clear-filter)
                  ("/" . elfeed-search-set-filter)
                  ("g" . elfeed-search-first-entry)
                  ("G" . elfeed-search-last-entry)
                  ("u" . md/elfeed-search-toggle-unread)
                  ("H" . md/elfeed-search-toggle-hide)
                  ("s" . md/elfeed-search-toggle-starred))

            (:map (elfeed-show-mode-map)
                  ("h" . elfeed-kill-buffer)
                  ("q" . elfeed-kill-buffer)
                  ("SPC" . md/leader-map)
                  ("C-h" . help-mode-map)
                  ("n" . evil-next-visual-line)
                  ("C-n" . evil-next-visual-line)
                  ("C-p" . evil-previous-visual-line)
                  ("C-f" . evil-scroll-page-down)
                  ("C-b" . evil-scroll-page-up)
                  ("C-d" . evil-scroll-down)
                  ("o" . elfeed-show-visit)
                  ("l" . elfeed-show-next-link)
                  ("j" . evil-next-visual-line)
                  ("k" . evil-previous-visual-line)
                  ("w" . evil-forward-word-begin)
                  ("b" . evil-backward-word-begin))))
#+end_src
* [[https://github.com/lewang/fic-mode][fic-mode]]

Small package that I find very useful - it just highlights a list of chosen
words in code comments.

#+begin_src emacs-lisp
(use-package fic-mode
  :hook ((prog-mode . fic-mode))
  :custom
  (fic-highlighted-words '("TODO" "FIX" "FIXME" "BUG" "WARN" "NOTE" "WARNING" "HACK" "NOTE" "ERROR" "MATT" "DEPRECATED" "BREAKPOINT") "")
  (fic-activated-faces '(font-lock-doc-face font-lock-comment-face)))
#+end_src

* [[https://github.com/mattduck/emacs-theme-gruvbox][Gruvbox theme]]

I mostly use a fork of the gruvbox theme where I've customised some of the faces
and theme variables.

#+begin_src emacs-lisp
(use-package gruvbox-theme
  :straight (gruvbox-theme :type git :host github :repo "greduan/emacs-theme-gruvbox"
                           :fork (:host github
                                        :repo "mattduck/emacs-theme-gruvbox"))
  :config
  (md/disable-all-themes)
  (load-theme 'gruvbox-dark-hard t))
#+end_src

* prog-mode

#+begin_src emacs-lisp
(use-package emacs
  :init

  (defun md/first-non-whitespace ()
    " Go to the first non-whitespace character on the current line or the next
couple of lines. This is useful after running the treesit defun movement as it
can put you on a character that isn't actually the start of the defun."
    (interactive)
    (let ((current-pos (point)))
      (beginning-of-line)
      (when (eolp)  ;; end of line, try line below
        (forward-line)
        (when (eolp)
          (forward-line)))
      (while (and (not (eobp))
                  (looking-at-p "\\s-"))
        (forward-char))
      (unless (eobp)
        (goto-char (point)))))

  (defun md/prev-defun ()
    (interactive)
    (beginning-of-line)
    (beginning-of-defun)
    (md/first-non-whitespace))

  (defun md/next-defun ()
    (interactive)
    (beginning-of-defun -1) ;; Goes to the start of next function
    (md/first-non-whitespace))

  :md/bind ((:map (prog-mode-map . motion)
                  ("gk" . md/prev-defun)
                  ("gj" . md/next-defun))))
#+end_src

* [[https://github.com/dominikh/go-mode.el][go-mode]]
#+BEGIN_SRC emacs-lisp
(use-package go-mode
  :demand t
  :config
  (progn
    (add-hook 'before-save-hook 'gofmt-before-save)))
#+END_SRC
* [[https://github.com/davazp/graphql-mode][graphql-mode]]

#+begin_src emacs-lisp
(use-package graphql-mode)
#+end_src

* [[https://github.com/magit/magit/blob/main/lisp/git-commit.el][git-commit]]

The ~git-commit~ package is part of ~magit~ (which I otherwise don't use
much). It provides useful behaviour when editing COMMIT_EDITMSG and other
similar temporary git files, eg. font highlighting, or ~C-c C-c~ and ~C-c C-k~
to save or quit.

#+begin_src emacs-lisp
(use-package git-commit
  :demand t
  :config
  (defun md/git-commit-setup ()
    "Basic setup for git-commit mode, eg. to set a fill column"
    (interactive)
    (setq fill-column 70)
    (display-fill-column-indicator-mode)
    (evil-normal-state))

  (add-hook 'git-commit-setup-hook 'md/git-commit-setup)
  (add-hook 'git-commit-setup-hook 'git-commit-turn-on-flyspell)

  ;; Remove some default hooks that I don't use
  (remove-hook 'git-commit-setup-hook 'git-commit-save-message)
  (remove-hook 'git-commit-setup-hook 'git-commit-setup-changelog-support)
  (remove-hook 'git-commit-setup-hook 'git-commit-turn-on-auto-fill)
  (remove-hook 'git-commit-setup-hook 'git-commit-propertize-diff)

  (global-git-commit-mode 1))
#+end_src

