emacs.2023.symlink/init.el

(use-package elfeed
  :after (evil)

  :init
  (defun md/elfeed-search-toggle-unread ()
    (interactive)
    (elfeed-search-toggle-all 'unread))

  (defun md/elfeed-search-toggle-hide ()
    (interactive)
    (elfeed-search-toggle-all 'hidden))

  (defun md/elfeed-search-toggle-starred ()
    (interactive)
    (elfeed-search-toggle-all 'starred))

  :config
  ;; Automatically remove the "unread" flag from anything older than 1 month
  (add-hook 'elfeed-new-entry-hook
            (elfeed-make-tagger :before "1 month ago"
                                :remove 'unread))

  ;; Default to emacs state so I can override bindings
  (evil-set-initial-state 'elfeed-search-mode 'emacs)
  (md/make-keymap-noop elfeed-search-mode-map)
  (evil-set-initial-state 'elfeed-show-mode 'emacs)
  (md/make-keymap-noop elfeed-show-mode-map)

  :custom
  (elfeed-search-title-max-width 110 "Truncate title width")
  (elfeed-search-filter "@2-weeks-ago -hidden !ojwtech" "Default search filter")

  :md/bind ((:map (md/leader-map)
                  ("R" . elfeed))

            (:map (elfeed-search-mode-map)
                  ("SPC" . md/leader-map)
                  ("C-h" . help-mode-map)
                  ("q" . elfeed-search-quit-window)
                  ("j" . evil-next-visual-line)
                  ("n" . evil-next-visual-line)
                  ("C-n" . evil-next-visual-line)
                  ("k" . evil-previous-visual-line)
                  ("p" . evil-previous-visual-line)
                  ("C-p" . evil-previous-visual-line)
                  ("C-f" . evil-scroll-page-down)
                  ("C-b" . evil-scroll-page-up)
                  ("C-d" . evil-scroll-down)
                  ("l" . elfeed-search-show-entry)
                  ("o" . elfeed-search-browse-url)
                  ("r" . elfeed-search-update--force)
                  ("R" . elfeed-search-fetch)
                  ("|" . elfeed-search-clear-filter)
                  ("/" . elfeed-search-set-filter)
                  ("g" . elfeed-search-first-entry)
                  ("G" . elfeed-search-last-entry)
                  ("u" . md/elfeed-search-toggle-unread)
                  ("H" . md/elfeed-search-toggle-hide)
                  ("s" . md/elfeed-search-toggle-starred))

            (:map (elfeed-show-mode-map)
                  ("h" . elfeed-kill-buffer)
                  ("q" . elfeed-kill-buffer)
                  ("SPC" . md/leader-map)
                  ("C-h" . help-mode-map)
                  ("n" . evil-next-visual-line)
                  ("C-n" . evil-next-visual-line)
                  ("C-p" . evil-previous-visual-line)
                  ("C-f" . evil-scroll-page-down)
                  ("C-b" . evil-scroll-page-up)
                  ("C-d" . evil-scroll-down)
                  ("o" . elfeed-show-visit)
                  ("l" . elfeed-show-next-link)
                  ("j" . evil-next-visual-line)
                  ("k" . evil-previous-visual-line)
                  ("w" . evil-forward-word-begin)
                  ("b" . evil-backward-word-begin))))

(use-package fic-mode
  :hook ((prog-mode . fic-mode))
  :custom
  (fic-highlighted-words '("TODO" "FIX" "FIXME" "BUG" "WARN" "NOTE" "WARNING" "HACK" "NOTE" "ERROR" "MATT" "DEPRECATED" "BREAKPOINT") "")
  (fic-activated-faces '(font-lock-doc-face font-lock-comment-face)))

(use-package gruvbox-theme
  :straight (gruvbox-theme :type git :host github :repo "greduan/emacs-theme-gruvbox"
                           :fork (:host github
                                        :repo "mattduck/emacs-theme-gruvbox"))
  :config
  (md/disable-all-themes)
  (load-theme 'gruvbox-dark-hard t))

(use-package go-mode
  :demand t
  :config
  (progn
    (add-hook 'before-save-hook 'gofmt-before-save)))

(use-package graphql-mode)

(use-package git-commit
  :demand t
  :config
  (defun md/git-commit-setup ()
    "Basic setup for git-commit mode, eg. to set a fill column"
    (interactive)
    (setq fill-column 70)
    (display-fill-column-indicator-mode)
    (evil-normal-state))

  (add-hook 'git-commit-setup-hook 'md/git-commit-setup)
  (add-hook 'git-commit-setup-hook 'git-commit-turn-on-flyspell)

  ;; Remove some default hooks that I don't use
  (remove-hook 'git-commit-setup-hook 'git-commit-save-message)
  (remove-hook 'git-commit-setup-hook 'git-commit-setup-changelog-support)
  (remove-hook 'git-commit-setup-hook 'git-commit-turn-on-auto-fill)
  (remove-hook 'git-commit-setup-hook 'git-commit-propertize-diff)

  (global-git-commit-mode 1))
