emacs.2023.symlink/init.el

(use-package git-gutter
  :demand t
  :init
  (defun md/maybe-git-gutter-mode ()
    "Unless file is too big, enter git-gutter mode (when in git dir)"
    (interactive)
    (when (and (< (count-lines (point-min) (point-max)) 1500)
               (not (eq major-mode 'org-mode)))
      (if (string= "git" (downcase (format "%s" (vc-backend
                                                 (buffer-file-name
                                                  (current-buffer))))))
          (git-gutter-mode 1))))
  (add-hook 'find-file-hook 'md/maybe-git-gutter-mode)

  :custom
  (git-gutter:ask-p nil "Don't ask for confirmation of gadd")
  (git-gutter:modified-sign "~" "Use format I initially got used to in the vim version")
  (git-gutter:added-sign "+")
  (git-gutter:deleted-sign "-")
  (git-gutter:unchanged-sign " ")
  (git-gutter:always-show-separator t)
  (git-gutter:separator-sign " " "Ensure there's some space between the gutter column and the code")

  :config

  (defun md/git-gutter-next-hunk ()
    (interactive)
    (call-interactively 'git-gutter:next-hunk)
    (evil-scroll-line-to-top nil)
    (call-interactively 'md/git-gutter-popup-hunk-overlay))

  (defun md/git-gutter-previous-hunk ()
    (interactive)
    (call-interactively 'git-gutter:previous-hunk)
    (evil-scroll-line-to-top nil)
    (call-interactively 'md/git-gutter-popup-hunk-overlay))

  (defun md/get-vc-root-dir (file-path)
    "Get the version control root directory for the given FILE-PATH. Using this so
  I can get the git directory when I'm not in that project."
    (let* ((backend (vc-responsible-backend file-path)))
      (if backend
          (vc-call-backend backend 'root file-path)
        (error "No version control for this file"))))

  (defvar-local md/git-history-file-name nil)

  (defun md/git-file-history ()
    "Show a consult list of the git log history for the current file.
On preview/action, open the file contents in a readonly buffer, and use
git-gutter to show which lines were added/changed/removed."
    (interactive)
    (when (or md/git-history-file-name (and buffer-file-name (vc-root-dir)))
      (let* ((file (or md/git-history-file-name (buffer-file-name)))
             (original-mode major-mode)
             (original-point (point))
             (git-root (md/get-vc-root-dir file))
             (relative-file (file-relative-name file git-root))
             ;; Update log-cmd to include commit hash, date, relative date, author, and message
             (log-cmd (format "git log --pretty=format:'%%h %%ad (%%ar) | %%an | %%s' --date=iso -- %s"
                              (shell-quote-argument file)))
             (log-entries (split-string (shell-command-to-string log-cmd) "\n" t))
             ;; Construct list of (display-string . commit-hash) pairs
             (colored-entries (mapcar (lambda (entry)
                                        (let* ((parts (split-string entry "\\s-+|\\s-+"))
                                               (hash-and-date (nth 0 parts))
                                               (author (nth 1 parts))
                                               (message (string-trim (nth 2 parts)))
                                               ;; Further split the hash-and-date part
                                               (hash (car (split-string hash-and-date)))
                                               (date-part (string-join (cdr (split-string hash-and-date)) " ")))
                                          ;; Construct display string and store commit hash in pair
                                          (cons (concat (propertize hash 'face 'font-lock-builtin-face)
                                                        " "
                                                        (propertize date-part 'face 'font-lock-string-face)
                                                        " | "
                                                        (propertize author 'face 'font-lock-keyword-face)
                                                        " | "
                                                        (propertize message 'face 'font-lock-variable-name-face))
                                                hash)))
                                      log-entries)))

        (consult--read (mapcar #'car colored-entries)
                       :prompt "Select commit: "
                       :sort nil
                       :require-match nil
                       ;; The :state function handles both preview and final selection
                       :state (lambda (action chosen-entry)
                                (when chosen-entry
                                  (let ((commit-hash (cdr (assoc chosen-entry colored-entries))))
                                    (md/do-git-file-history commit-hash file relative-file original-mode action original-point))))))))

  (defun md/do-git-file-history (commit-hash file relative-file original-mode action original-point)
    "Open or preview the file content for COMMIT-HASH using RELATIVE-FILE and ORIGINAL-MODE.
Restores the cursor as close as possible to the ORIGINAL-POINT."
    (let* ((buffer-name
            (if (eq action 'preview)
                "*md/git-timemachine-preview*"
              (format "*md/git-timemachine %s*" relative-file)))
           (git-root (locate-dominating-file relative-file ".git"))
           (original-line-content (thing-at-point 'line t)))
      (with-current-buffer (get-buffer-create buffer-name)
        (setq-local default-directory git-root)
        (setq buffer-read-only nil)
        (erase-buffer)
        ;; Fetch and insert the file content for the given commit
        (message default-directory)
        (insert (shell-command-to-string
                 (format "git --no-pager show %s:%s" commit-hash (shell-quote-argument relative-file))))
        ;; Apply the original major mode
        (funcall original-mode)
        (setq buffer-read-only t)
        ;; Restore the cursor position (or as close as possible)
        (pop-to-buffer (current-buffer))
        (goto-char (min original-point (point-max)))
        (recenter)
        ;; Naive attempt to look at the same place in the file: try to match the
        ;; current line. Won't work when there are duplicates.
        (if (search-forward original-line-content nil t)
            (recenter)
          (if (search-backward original-line-content nil t)
              (recenter)))

        ;; Git-gutter stuff
        (let ((inhibit-read-only t)
              (diff-results nil))
          (with-temp-buffer
            ;; Run git diff command and insert output into the temp buffer
            (setq-local default-directory git-root)
            (process-file "git" nil (current-buffer) nil
                          "--no-pager" "-c" "diff.autorefreshindex=0"
                          "diff" "--no-color" "--no-ext-diff" "-U0"
                          (format "%s^" commit-hash) commit-hash "--" relative-file)
            (setq diff-results (git-gutter:process-diff-output (current-buffer))))

          ;; Use the diff result to apply git-gutter
          (git-gutter:update-diffinfo diff-results)
          (git-gutter)
          (setq md/git-history-file-name file)
          ))))

  (defun md/git-gutter-popup-hunk-overlay ()
    "Check if the current line has changed, and if so, call `git-gutter:popup-hunk`."
    (interactive)
    ;; Check diffinfos rather than git-gutter-mode, as this way it catches my history function
    (when (and (bound-and-true-p git-gutter:diffinfos))
      (condition-case nil
          ;; We don't show added popups as that's obvious from the buffer
          (when (not (eq (git-gutter-hunk-type (git-gutter:search-here-diffinfo git-gutter:diffinfos)) 'added))
            (md/with-display-buffer-alist
             '("*\\(git-gutter:diff\\)"
               (md/display-buffer-in-overlay-margin))
             (git-gutter:popup-hunk)))
        (error
         (quit-windows-on git-gutter:popup-buffer)
         ))))

  :md/bind ((:map (md/leader-map)
                  ("g <RET>" . git-gutter-mode)
                  ("gh" . md/git-file-history)
                  ("gl" . md/git-gutter-popup-hunk-overlay)
                  ("gL" . git-gutter:popup-hunk)
                  ("gk" . md/git-gutter-previous-hunk)
                  ("gp" . md/git-gutter-previous-hunk)
                  ("gj" . md/git-gutter-next-hunk)
                  ("gn" . md/git-gutter-next-hunk)
                  ("g+" . git-gutter:stage-hunk)
                  ("g-" . git-gutter:revert-hunk))
            (:map (evil-normal-state-map)
                  ("C-j" . md/git-gutter-next-hunk)
                  ("C-k" . md/git-gutter-previous-hunk))))
