emacs.2023.symlink/init.org
* [[https://github.com/ozanmakes/github-browse-file][github-browse-file]]

#+BEGIN_SRC emacs-lisp
  (use-package github-browse-file
    :demand t
    :config
    (progn
      (setq github-browse-file-show-line-at-point t))
    :bind (:map md/leader-map
          ("go" . github-browse-file)))
#+END_SRC

* [[https://github.com/Alexander-Miller/treemacs][Treemacs]]

The new(ish) treesit imenu integration is pretty useful, and Treemacs shows
imenu nodes underneath files by default, so I'm switching to it over Neotree
(which doesn't support imenu).

#+begin_src emacs-lisp
(use-package treemacs
  :demand t
  :init
  (defun md/treemacs-mode-hook ()
    ;; Treemacs seems to use this by default, and I can't see a way to disable it via variables.
    (hl-line-mode -1)
    ;; Don't follow current buffers
    (treemacs-follow-mode -1))

  :hook ((treemacs-mode . md/treemacs-mode-hook))

  :custom
  (treemacs-no-png-images t "Don't use icons, too noisy")
  (treemacs-indentation 1 "Tree can get deep so use minimum indent")
  (treemacs-space-between-root-nodes nil "Don't show newlines between projects")

  :config
  ;; Override the fallback icons. I ignore the :icon value here as I'm not using png icons.
  (treemacs-modify-theme "Default"
    :config
    (progn
      (treemacs-create-icon :icon "" :fallback "  " :extensions '(tag-leaf))
      (treemacs-create-icon :icon "" :fallback "  " :extensions '(tag-open))
      (treemacs-create-icon :icon "" :fallback "+ " :extensions '(tag-closed))))

  (defun md/treemacs ()
    "Setup some variables before running treemacs"
    (interactive)
    ;; Reduce the margin width to make better use of space.
    (let ((left-margin-width 0))
      (call-interactively 'treemacs)))

  (defun md/treemacs-current-project ()
    (interactive)
    (call-interactively #'treemacs-add-and-display-current-project)
    (call-interactively #'treemacs-collapse-other-projects))

  :md/bind ((:map (md/leader-map)
                  ("T" . md/treemacs)
                  ("jT" . md/treemacs-current-project))
            (:map (treemacs-mode-map . normal)
                  ("l" . treemacs-TAB-action)
                  ("h" . treemacs-TAB-action)
                  ("r" . treemacs-refresh)
                  ("M-k" . treemacs-move-project-up)
                  ("M-j" . treemacs-move-project-down))))
#+end_src

* [[https://magit.vc/][Magit]]

#+begin_src emacs-lisp
(use-package magit
  :init

  (defun md/send-emacs-ret ()
    "Send RET in emacs state, and then put the buffer back in normal state.
This is useful because RET is bound to different functions at different points
in magit buffers and I'm not sure an easy way to replicate that in my normal
mode bindings"
    (interactive)
    (let ((orig-buf (current-buffer)))
      (evil-emacs-state)
      (execute-kbd-macro (kbd "RET"))
      (with-current-buffer orig-buf
        (evil-normal-state))))

  :config
  (evil-set-initial-state 'magit-status-mode 'normal)
  (evil-set-initial-state 'magit-blame-mode 'normal)
  (evil-set-initial-state 'magit-log-mode 'normal)
  (evil-set-initial-state 'magit-diff-mode 'normal)
  (evil-set-initial-state 'magit-revision-mode 'normal)
  :md/bind (
            (:map (md/leader-map)
                  ("gg" . magit-status)
                  ("gb" . magit-blame)
                  ("gl" . magit-log)
                  ("gC" . magit-commit)
                  ("gP" . magit-push))
            (:map (magit-blame-mode-map . normal)
                  ("RET" . magit-show-commit)
                  ("q" . magit-blame-quit)
                  ("gj" . magit-blame-next-chunk)
                  ("gk" . magit-blame-previous-chunk))
            (:map (magit-status-mode-map . normal)
                  ("j" . magit-next-line)
                  ("k" . magit-previous-line)
                  ("gj" . magit-section-forward)
                  ("gk" . magit-section-backward)
                  ("<RET>" . md/send-emacs-ret)
                  ("C" . magit-commit)
                  ("R" . magit-refresh)
                  ("+" . magit-stage)
                  ("-" . magit-unstage))
            (:map (magit-section-mode-map . normal)
                  ("j" . magit-next-line)
                  ("k" . magit-previous-line)
                  ("gj" . magit-section-forward)
                  ("gk" . magit-section-backward))
            (:map (magit-log-mode-map . normal)
                  ("<RET>" . md/send-emacs-ret))))
#+end_src

