emacs.2023.symlink/init.el

(use-package github-browse-file
  :demand t
  :config
  (progn
    (setq github-browse-file-show-line-at-point t))
  :bind (:map md/leader-map
        ("go" . github-browse-file)))

(use-package treemacs
  :demand t
  :init
  (defun md/treemacs-mode-hook ()
    ;; Treemacs seems to use this by default, and I can't see a way to disable it via variables.
    (hl-line-mode -1)
    ;; Don't follow current buffers
    (treemacs-follow-mode -1))

  :hook ((treemacs-mode . md/treemacs-mode-hook))

  :custom
  (treemacs-no-png-images t "Don't use icons, too noisy")
  (treemacs-indentation 1 "Tree can get deep so use minimum indent")
  (treemacs-space-between-root-nodes nil "Don't show newlines between projects")

  :config
  ;; Override the fallback icons. I ignore the :icon value here as I'm not using png icons.
  (treemacs-modify-theme "Default"
    :config
    (progn
      (treemacs-create-icon :icon "" :fallback "  " :extensions '(tag-leaf))
      (treemacs-create-icon :icon "" :fallback "  " :extensions '(tag-open))
      (treemacs-create-icon :icon "" :fallback "+ " :extensions '(tag-closed))))

  (defun md/treemacs ()
    "Setup some variables before running treemacs"
    (interactive)
    ;; Reduce the margin width to make better use of space.
    (let ((left-margin-width 0))
      (call-interactively 'treemacs)))

  (defun md/treemacs-current-project ()
    (interactive)
    (call-interactively #'treemacs-add-and-display-current-project)
    (call-interactively #'treemacs-collapse-other-projects))

  :md/bind ((:map (md/leader-map)
                  ("T" . md/treemacs)
                  ("jT" . md/treemacs-current-project))
            (:map (treemacs-mode-map . normal)
                  ("l" . treemacs-TAB-action)
                  ("h" . treemacs-TAB-action)
                  ("r" . treemacs-refresh)
                  ("M-k" . treemacs-move-project-up)
                  ("M-j" . treemacs-move-project-down))))

(use-package magit
  :config
  (add-hook 'magit-blame-mode-hook 'evil-normal-state)
  :md/bind ((:map (md/leader-map)
                  ("gb" . magit-blame))
            (:map (magit-blame-mode-map . normal)
                  ("RET" . magit-show-commit)
                  ("q" . magit-blame-quit)
                  ("gn" . magit-blame-next-chunk)
                  ("gk" . magit-blame-previous-chunk))))
