emacs.2023.symlink/init.org
* Eglot

I used to use lsp-mode but like that this is builtin and integrates better with
existing emacs features. Also seems to require less configuration.

#+begin_src emacs-lisp
(use-package eglot
  :straight nil ;; Use the builtin version, don't download
  :config
  ;; eldoc and flymake make too much noise -- disable by default.
  ;;
  ;; For imenu, the languages I'm initially using with eglot are using have imenu
  ;; functions provided by treesit, which use labels like *class definition* and
  ;; *function definition* to show the imenu results as a tree in the same order
  ;; defined in the file. Eglot seems to instead break it into symbol types,
  ;; which is much less useful. So we stick with the treesit implementation for now,
  ;; and just use eglot for project-wide search etc.
  ;;
  ;; For some reason this doesn't get picked up setting via :custom, so we do it
  ;; with setq.
  (setq eglot-stay-out-of '(flymake imenu))

  ;; Changes supposed to help with performance
  (fset #'jsonrpc--log-event #'ignore)
  (setq eglot-events-buffer-size 0)

  ;; [2024-10-27] Eglot hard-codes calling this function on eldoc symbol hover,
  ;; to highlight the current symbol with eglot-highlight-symbol-face. I don't
  ;; want this but there's no builtin way to disable it, so just redefine the
  ;; function.
  (defun eglot--highlight-piggyback (cb))

  ;; TODO: these functions are very rough atm, needs some work
  (define-derived-mode md/eglot-helpful-mode special-mode "Eglot-Helpful"
    "Major mode for displaying Eglot information about a symbol. Similar to help/helpful,
but for elgot rather than emacs lisp"
    (read-only-mode 1))

  (defun md/eglot-helpful ()
    "Display information about the symbol at point in a buffer named '*eglot-helpful*', and switch to it."
    (interactive)
    (if-let ((server (eglot-current-server))
             (symbol-name (thing-at-point 'symbol t))
             (original-buffer (current-buffer)))  ;; Store the original buffer
        (with-current-buffer (get-buffer-create "*eglot-help*")
          ;; Temporarily disable read-only mode
          (read-only-mode -1)
          (erase-buffer)
          (insert (format "Symbol: %s\n\n" symbol-name))
          ;; Switch to the original buffer to retrieve hover info
          (insert (or (with-current-buffer original-buffer
                        (md/eglot-get-hover-info)) ""))

          (insert "\n")
          (insert (or (with-current-buffer original-buffer
                        (md/eglot-get-full-definition)) ""))
          ;; Re-enable read-only mode and switch to our custom mode
          (md/eglot-helpful-mode)
          ;; Display and switch to the buffer
          (pop-to-buffer (current-buffer))
          (goto-char (point-min)))
      (message (if (eglot-current-server)
                   "No symbol at point."
                 "No active Eglot server for the current buffer."))))

  (defun md/eglot-get-hover-info ()
    "Get hover information for the symbol at point using Eglot and return it as a propertized string."
    (when-let ((server (eglot-current-server)))
      (let* ((hover-info (jsonrpc-request server :textDocument/hover
                                          (eglot--TextDocumentPositionParams)))
             (contents (plist-get hover-info :contents))
             (range (plist-get hover-info :range)))
        (if (and contents (not (seq-empty-p contents)))
            (eglot--hover-info contents range)  ;; Use eglot's internal hover formatting
          "No hover information available."))))

  (defun md/eglot-get-full-definition ()
    "Get the full definition range for the symbol at point using `textDocument/definition` and `textDocument/documentSymbol`."
    (when-let* ((server (eglot-current-server))
                (symbol-name (thing-at-point 'symbol t))
                ;; Step 1: Get the definition location of the symbol at point
                (definition-info (jsonrpc-request server :textDocument/definition
                                                  (eglot--TextDocumentPositionParams))))
      ;; Extract the URI and position from the definition-info
      (pcase definition-info
        (`[(:uri ,uri :range (:start ,_start :end ,_end))]
         ;; Step 2: Get document symbols in the target file (URI)
         (md/find-symbol-in-external-file symbol-name uri))
        (_ (message "No definition found for symbol: %s" symbol-name)))))

  (defun md/find-symbol-in-external-file (symbol-name uri)
    "Find SYMBOL-NAME in the external file specified by URI and return its full definition range."
    (let ((server (eglot-current-server))
          (document-symbols (jsonrpc-request server :textDocument/documentSymbol
                                             `(:textDocument (:uri ,uri)))))
      ;; Convert the URI to a file path and find the full definition range in the document symbols
      (md/find-symbol-in-symbols symbol-name document-symbols (eglot--uri-to-path uri))))

  (defun md/find-symbol-in-symbols (symbol-name symbols filename)
    "Search recursively in SYMBOLS from FILENAME to find the full range for SYMBOL-NAME."
    (setq symbols (if (vectorp symbols) (append symbols nil) symbols))  ;; Ensure symbols is a list
    (catch 'found
      (dolist (symbol symbols)
        (let ((name (plist-get symbol :name))
              (range (plist-get symbol :range)))
          (cond ((and name (string= name symbol-name))
                 (throw 'found (md/eglot--fetch-code-snippet filename
                                                             (plist-get range :start)
                                                             (plist-get range :end))))
                ((plist-get symbol :children)
                 (let ((result (md/find-symbol-in-symbols symbol-name (plist-get symbol :children) filename)))
                   (when result
                     (throw 'found result)))))))))

  (defun md/eglot--fetch-code-snippet (filename start end)
    "Fetch code snippet from FILENAME between START and END positions."
    (when (and filename (file-readable-p filename))
      (with-temp-buffer
        (insert-file-contents filename)
        (goto-char (point-min))
        ;; Convert LSP positions to buffer positions
        (let ((beg (eglot--lsp-position-to-point start))
              (fin (eglot--lsp-position-to-point end))
              (mode (assoc-default filename auto-mode-alist #'string-match)))
          (when mode
            (funcall mode)
            (font-lock-ensure))
          (buffer-substring beg fin)))))


  :custom
  (eglot-report-progress nil "Eglot spams the minibuffer a lot on save -- this seems to keep it quieter")

  :md/bind ((:map (md/leader-map)
                  ("ll" . eglot)
                  ("lL" . eglot-shutdown))
            (:map (md/eglot-helpful-mode-map  . normal)
                  ("q" . md/quit-and-kill-window))))
#+end_src

