emacs.2023.symlink/init.org
** [[https://github.com/mohkale/consult-eglot][consult-eglot]]

[2024-02-28] Useful package providing a consult interface for the
~workspace/symbols~ lsp call. This just provides one command --
~consult-eglot-symbols~. It's similar to xref-find-apropros but lets you
view/group/filter the type of symbol, so you can more easily see eg.
just function definitions and ignore variables.

#+begin_src emacs-lisp
(use-package consult-eglot
  :after (consult eglot)
  :init

  (defun md/consult-eglot-xref-dwim ()
    "If eglot is enabled and managing xref, consult-eglot-symbols is
similar to xref-find-apropos, because they both call :workspace/symbol on the
language server. The main difference is that consult-eglot-symbols groups and
lets you filter by symbol type, which can be useful if there are lots of
matches. Xref-find-apropos groups by file and doesn't show the type of the
symbol. I don't want to have to think about using both functions, so if
consult-eglot-symbols works, we'll use that, otherwise we fall back to
xref-find-apropos.

This should catch cases both where eglot isn't running for a buffer, and also
where the language server doesn't support the workspace/symbol call, in which
case if another xref backend is available that will be used instead.

If the eglot xref backend gets updated to provide more symbol-type-aware
features, then I can get rid of this and just use xref."
    (interactive)
     (condition-case nil
         (call-interactively #'consult-eglot-symbols)
       (error
        (call-interactively #'xref-find-apropos))))

  :md/bind ((:map (md/leader-map)
              ("j ." . md/consult-eglot-xref-dwim))))
#+end_src

* Eldoc

#+begin_src emacs-lisp
(use-package eldoc
  :straight nil
  :demand t

  :custom
    (eldoc-documentation-strategy 'eldoc-documentation-compose "Allow eldoc to pull in info from multiple sources")
    (eldoc-echo-area-use-multiline-p nil "Don't keep increasing the minibuffer size to show big docs"))
#+end_src

* Treesit

[2024-02-26] Start use treesitter for syntax highlighting and other features
that make use of the AST.

#+begin_src emacs-lisp
(use-package treesit
  :straight nil
  :demand t

  :config
  (defun md/treesit-install-all-languages ()
    "From https://www.masteringemacs.org/article/how-to-get-started-tree-sitter"
    (interactive)
    (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist)))

  :custom
  (treesit-language-source-alist
   '((python "https://github.com/tree-sitter/tree-sitter-python"))
   "The treesitter grammars to use")

  (major-mode-remap-alist
   '((python-mode . python-ts-mode))
   "Introduced in Emacs 29, presumably to support treesitter")

  (treesit-font-lock-level 4))
#+end_src

* [[https://github.com/emacs-tree-sitter/treesit-fold/tree/master][treesit-fold]]

Try using treesit fold to provide org-like folding. I've tried similar things in
the past eg. with hideshow but it's not been reliably -- hopefully treesitter
can solve this. ~treesit-fold~ doesn't provide org toggle recursive features out
of the box, so I'll have to come back and add this in.

#+begin_src emacs-lisp
(use-package treesit-fold
  :straight (treesit-fold :type git :host github :repo "emacs-tree-sitter/treesit-fold")
  :demand t
  :config

  (defun md/treesit-fold-global-toggle ()
    "Treesit doesn't provide a global toggle function"
    (interactive)
    ;; There's no builtin function that encapsulates the "is anything folded"
    ;; concept, but it looks like we can pull these overlays within a region
    ;; to achieve it
    (if (treesit-fold--overlays-in 'invisible 'treesit-fold (point-min) (point-max))
        (treesit-fold-open-all)
      (treesit-fold-close-all)))

  :hook (prog-mode . treesit-fold-mode)
  :md/bind ((:map (prog-mode-map . normal)
                  ("<tab>" . treesit-fold-toggle)
                  ("<backtab>" . md/treesit-fold-global-toggle))))
#+end_src

* [[https://github.com/emacsmirror/rainbow-mode][rainbow-mode]]

#+begin_src emacs-lisp
(use-package rainbow-mode
  :hook
  ((css-mode . rainbow-mode)
   (help-mode . rainbow-mode)
   (html-mode . rainbow-mode))
  :bind (:map md/leader-map
              ("tr" . rainbow-mode)))
#+end_src

* [[https://github.com/hcl-emacs/terraform-mode][terraform-mode]]

I just use this to get basic syntax highlighting.

#+begin_src emacs-lisp
(use-package terraform-mode)
#+end_src

* python-mode

[2024-10-27] This includes some additional utils which, although not strictly
dependent on python-mode, are python related. The

#+begin_src emacs-lisp
(use-package python
  :demand t

  :init
  (defun md/find-python-executable ()
    "Find the current project's python executable. If a venv directory exists in
the project root, this takes preference. Otherwise, we try to look at
pyrightconfig.json, as this is where I'm telling pyright which python
to use.

This can be used to run scripts in the context of the project's python -- this is initially
just used by md/find-python-packages, but have other uses."

    "Return the path to 'venv/bin/python' in the current project root, if it exists.
If no 'venv/bin/python' file is found, check for a `pyrightconfig.json` file to locate
the Python executable in an external virtual environment.
If both attempts fail, return 'python' as a fallback."

    (let* ((project-root (project-root (project-current)))
           ;; If there's a venv directory, prefer it
           (default-python-path (expand-file-name "venv/bin/python" project-root)))
      (if (and default-python-path (file-executable-p default-python-path))
          default-python-path
        ;; If no venv directory, assume I'm configuring `pyrightconfig.json` and we can grab it there
        (let* ((pyright-config (expand-file-name "pyrightconfig.json" project-root))
               (python-path
                (when (file-exists-p pyright-config)
                  (let* ((config (json-read-file pyright-config))
                         (venv-path (cdr (assoc 'venvPath config)))
                         (venv-name (cdr (assoc 'venv config))))
                    (when (and venv-path venv-name)
                      (expand-file-name "bin/python" (expand-file-name venv-name venv-path)))))))
          ;; Return the found path or fallback to "python" if not found
          (if (and python-path (file-executable-p python-path))
              python-path
            "python")))))

  (defun md/find-python-packages ()
    "Run a python script to figure out all the importable packages and their paths. Returns
the list of paths. Idea is that this can be used to run consult-ripgrep or consult-fd, or eglot
commands. It seems to be a lot more reliable and faster than attempting to get the same info
out of eglot or an lsp server directly."
    (let* ((script-path (md/dotfiles-get-path "emacs.2023.symlink/find_packages.py"))
           (output (shell-command-to-string (concat (md/find-python-executable) " " (shell-quote-argument script-path)))))
      (if (string-empty-p output)
          (message "No packages found or script returned empty output.")
        (split-string output "\n" t))))

  :config
  (defun md/python-imenu-format-item-label (type name)
    "Instead of the default format of eg. `my_function (def)`, use `def:
myfunction`. This makes it easier to read."
    (format "%s: %s" type name))

  :custom
  (python-imenu-format-item-label-function #'md/python-imenu-format-item-label)
  (python-imenu-format-parent-item-label-function #'md/python-imenu-format-item-label))
#+end_src

* [[https://github.com/emacs-php/php-mode][php-mode]]

#+begin_src emacs-lisp
(use-package php-mode)
#+end_src

* dockerfile-mode
#+begin_src emacs-lisp
(use-package dockerfile-mode)
#+end_src

* yaml-mode

#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src

* [[https://github.com/fxbois/web-mode][web-mode]]

#+begin_src emacs-lisp
(use-package web-mode
  :mode
  (("\\.html\\'" . web-mode))
  (("\\.djhtml\\'" . web-mode))
  :custom
  (web-mode-enable-engine-detection t))
#+end_src

* diff-mode

Builtin diff mode.

#+begin_src emacs-lisp
(use-package diff-mode
  :md/bind ((:map (diff-mode-map . normal)
                  ("q" . quit-window))))
#+end_src

* conf-mode

Builtin mode for editing different config files -- I think the only feature I
actually use here is the syntax highlighting.

#+BEGIN_SRC emacs-lisp
  (use-package conf-mode
    :mode (("\\.conf\\'" . conf-mode)
           ("\\.cfg\\'" . conf-mode)
           ("\\.*rc\\'" . conf-mode)
           ("\\.ssh/config\\'" . conf-mode)
           ("\\.ini\\'" . conf-mode)))
#+END_SRC
* [[https://github.com/jrblevin/markdown-mode][markdown-mode]]

This includes ~gfm-mode~ for Github-flavoured markdown.

Note -- compiling requires ~markdown~ to be installed.

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.gfm\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :md/bind ((:map (markdown-mode-map . normal)
                  ;; Markdown-cycle behaves like org-cycle, but by default is only
                  ;; enabled in insert mode. gfm-mode-map inherits from
                  ;; markdown-mode-map, so this will enable it in both.
                  ("TAB" . markdown-cycle)
                  ("gk" . markdown-previous-visible-heading)
                  ("gj" . markdown-next-visible-heading))))
#+END_SRC

