emacs.2023.symlink/init.org
* [[https://github.com/karthink/gptel][gptel]]

#+begin_src emacs-lisp
(use-package gptel
  :init

  (defun md/org-mode-gptel-hook ()
    "If an org buffer ends in .gptel.org, start gptel-mode."
    (when (and (buffer-file-name)
               (string-suffix-p ".gptel.org" (buffer-file-name)))
      (gptel-mode)))

  (defun md/gptel-goto-next ()
    "Move to the next line that matches the horizontal rule we're using as a chat
  divider."
    (interactive)
    (let ((current-pos (point))
          (regex "^-\\{5,\\}"))
      (forward-char 1)  ;; If we're already on one we don't want to match the same one
      (if (re-search-forward regex nil t)
          (goto-char (match-beginning 0))
        (goto-char current-pos) (message "No match"))))

  (defun md/gptel-goto-previous ()
    "Move to the previous line that matches the horizontal rule we're using as a
chat divider"
    (interactive)
    (let ((current-pos (point))
          (regex "^-\\{5,\\}"))
      (if (re-search-backward regex nil t)
          (goto-char (match-beginning 0))
        (goto-char current-pos) (message "No match"))))

  (defun md/gptel-post-response (start end)
    "Try to fill columns for the text items in the response.
This makes it easier to read and more consistent with the rest of the buffer.

We do this in a temp buffer and then replace the original contents: this way it's possible
to get the size of the new region, and add the appropriate text properties so that gptel
knows it's a response."
    (when (eq major-mode 'org-mode)
      (let* ((original-text (buffer-substring-no-properties start end))
             (original-size (length original-text))
             ;; gptel seems to have two states for its text properties: text is either
             ;; it's part of the response, or its part of the request prompt.
             ;; This means the prompt and response prefixes get grouped into one of those.
             ;; gptel includes code that tries to strip the prefixes in a couple of places,
             ;; but it doesn't work reliably. The result is that the prompt prefix can get
             ;; sent to the LLM, and the LLM sometimes then imitates it in the
             ;; response and you end up with duplicates.
             ;;
             ;; To get around this, I'm stripping all occurrences of the prefix
             ;; from the response text, and then we re-insert them if needed
             ;; below.
             (original-text-no-prefixes
              (s-trim
              (replace-regexp-in-string
               (regexp-quote (s-trim (gptel-prompt-prefix-string)))
               ""
               (replace-regexp-in-string
                (regexp-quote (s-trim (gptel-response-prefix-string)))
                              "" original-text))))
             (in-gptel-mode gptel-mode)
             (new-size)
             (size-difference)
             (new-end)
             (el)
             (new-text))

        (with-temp-buffer
          (org-mode) ;; must be done before the prefix insert
          (when (not in-gptel-mode)
            ;; gptel-mode has the useful feature of inserting prompt/response prefix strings.
            ;; These are not used if invoked directly as (gptel-send) outside the context of the buffer,
            ;; but I would like to do that. So, if we're not in gptel-mode
            ;; already, insert the response prefix string.
            (insert (gptel-response-prefix-string)))
          (insert original-text-no-prefixes)
          (goto-char (point-min))
          (while (not (eobp))
            (setq el (org-element-at-point))
            (when (or (eq (org-element-type el) 'paragraph)
                      (eq (org-element-type el) 'item)
                      (eq (org-element-type el) 'plain-list))
              (org-fill-element))
            (forward-line 1))
          ;; Similar to the the response prefix -- see above.
          ;;
          ;; NOTE: I originally wrapped this in (when (not in-gptel-mode)), but
          ;; my custom prefix stripping implementation above means that we also
          ;; need to insert this in gptel mode.
          (insert "\n\n" (gptel-prompt-prefix-string))
          (setq new-size (buffer-size))
          (setq size-difference (- new-size original-size)) ;; New size expected to be bigger
          (setq new-text (buffer-string))
          (setq new-end (+ end size-difference)))

        ;;(message "start:%s end:%s new-size:%s size-difference:%s new-end:%s original-text:%s new-text:%s"
        ;;         start end new-size size-difference new-end original-text new-text)

        ;; Replace the text
        (goto-char start)
        (delete-region start end)
        (insert new-text)

        ;; gptel uses text properties to figure out which parts of the buffer were
        ;; returned by the gptel response. When we modify the post-response
        ;; region, it ruins the gptel text property, so we add it back manually
        ;; here taking into account the full range of the new response content.
        (add-text-properties start new-end '(gptel response))
        (md/fontify-buffer))))


  (defun md/gptel-context-remove ()
    "gptel doesn't provide a way to remove all context without
interacting with the context buffer.

This provides a shorthand to do that by setting gptel-context--alist to nil. We
also call the context-remove function, so that if gptel has highlighted part of
a buffer and I'm currently looking at that buffer, the highlights will be
removed.

TBD on how well this works."
    (interactive)
    (setq gptel-context--alist nil)
    (gptel-context-remove)
    (message "Removed all gptel context"))

  (defun md/gptel-context-dwim ()
    "Add context. gptel provides an add dwim function but I don't like how it behaves."
    (interactive)
    (cond
     ;; If the region is active
     ((use-region-p)
      (gptel-context--add-region (current-buffer)
                                 (region-beginning)
                                 (region-end))
      (deactivate-mark))
     ;; If the buffer is not narrowed and is visiting a file
     ((and (not (buffer-narrowed-p))
           (buffer-file-name))
      (gptel-add-file (buffer-file-name)))
     ;; If the buffer is narrowed or is not visiting a file
     (t
      (gptel-add))))

  (defun md/gptel-rewrite-code ()
    "Gptel provides a rewrite feature, but it makes you interact with it through the menu
to accept/reject changes, and I just want something simple that rewrites the region."
    (interactive)
    (if (use-region-p)
        (let ((bounds (cons (region-beginning) (region-end))))
          (gptel-request
              (buffer-substring-no-properties (car bounds) (cdr bounds)) ; the prompt
            :system "You are a code-producing machine. Respond only with the replacement version of the code: NEVER RETURN MARKDOWN,
EXTRA FORMATTING OR ANY OTHER EXPLANATION. Keep the user's original comments in your response as much as possible."
            :buffer (current-buffer)
            :context (cons (set-marker (make-marker) (car bounds))
                           (set-marker (make-marker) (cdr bounds)))
            :callback
            (lambda (response info)
              (if (not response)
                  (message "ChatGPT response failed with: %s" (plist-get info :status))
                (let* ((bounds (plist-get info :context))
                       (beg (car bounds))
                       (end (cdr bounds))
                       (buf (plist-get info :buffer)))
                  (with-current-buffer buf
                    (save-excursion
                      (goto-char beg)
                      (kill-region beg end)
                      (insert response)
                      (set-marker beg nil)
                      (set-marker end nil)
                      (message "Rewrote region. Original region saved to kill-ring."))))))))
      (message "Not in region")))

  (defun md/gptel-send ()
    "Call gptel-send, but only if a topic is set. This is to prevent
accidentally calling it in buffers that I don't want to share."
    (interactive)
    (if (derived-mode-p 'org-mode)
        (let* ((gptel-topic (org-entry-get (point) "GPTEL_TOPIC" t))
               ;; When in a standard org buffer (rather than the gptel minor mode),
               ;; gptel doesn't insert the usual prompt/response prefix. I find this useful,
               ;; so I do want it if I'm in org-mode.
               (gptel-stream t))
          (if gptel-topic
              (gptel-send)
            (message "needs GPTEL_TOPIC property")))
      (gptel-send)))

  (defun md/gptel-org-properties ()
    "Insert a topic and properties. Generally I only plan to use gptel for org
buffers that have this set"
    (interactive)
    ;; Rather than calling gptel-org-set-topic, which is always interactive,
    ;; we just insert the org property directly.
    (org-set-property
     "GPTEL_TOPIC"
     (downcase
      (truncate-string-to-width
       (substring-no-properties
        (replace-regexp-in-string
         "\\s-+" "-"
         (org-get-heading)))
       50)))
    ;; Store the gptel prompt and model etc. This makes it easy to edit
    ;; if I want to use something different to default.
    (call-interactively 'gptel-org-set-properties))

  :config
  (add-hook 'org-mode-hook 'md/org-mode-gptel-hook)
  (font-lock-add-keywords 'org-mode '(("^-\\{5,\\}" (0 'comint-highlight-prompt))))

  :custom
  (gptel-default-mode 'org-mode "Use org in the chat buffer")
  (gptel-log-level 'info "Log requests and responses to buffer")
  (gptel--system-message "You are a large language model living in Emacs and a helpful assistant. Respond concisely. Never use org headings in your response. Always put newlines between list elements." "Customise the default system prompt")
  (gptel-prompt-prefix-alist
   '((markdown-mode . "### ")
     (org-mode . "----- [user]\n\n")
     (text-mode . "### "))
   "Use a clearer prompt/response divider for org")
  (gptel-response-prefix-alist
   '((markdown-mode . "")
     (org-mode . "----- [assistant]\n\n")
     (text-mode . ""))
   "Use a clearer prompt/response divider for org")

  (gptel-post-response-functions '(md/gptel-post-response))

  :md/bind ((:map (org-mode-map)
                  ("C-c <RET>" . md/gptel-send))
            (:map (md/leader-map)
                  ("G <RET>" . md/gptel-send)
                  ("Gk" . md/gptel-goto-previous)
                  ("Gj" . md/gptel-goto-next)
                  ("Gt" . md/gptel-org-properties)
                  ("G+" . md/gptel-context-dwim)
                  ("G-" . md/gptel-context-remove)
                  ("GR" . md/gptel-rewrite-code)
                  ("GG" . gptel))))
#+end_src

Looking at ~*gptel-log*~, here's how the API content works:

- The org chat minor-mode buffer sends everything as context, unless you start a
  new org topic using ~GPTEL_TOPIC~. It uses overlays to identify previous
  requests/responses in the buffer, and these get sent as history for each
  request.

- The ~gptel-send~ feature works similarly. It does not share history with
  other org chat sessions, but uses overlays to identify messages so you can
  build up a similar chat experience.

- If you edit the buffer contents that includes the request/response messages,
  then on next message the history sent will be your edited version.

- By default, added gptel context gets put into the system "content" value. This
  is included both for ~gptel-send~, and the minor-mode chat buffers. This
  context also appears in requests made manually with ~(gptel-request)~: even if
  you specify ~:context~ in the call, your global gptel context will be appended
  to it.

