emacs.2023.symlink/init.el

(use-package gptel
  :init

  (defun md/gptel-context-remove ()
    "gptel doesn't provide a way to remove all context without
interacting with the context buffer.

This provides a shorthand to do that by setting gptel-context--alist to nil. We
also call the context-remove function, so that if gptel has highlighted part of
a buffer and I'm currently looking at that buffer, the highlights will be
removed.

TBD on how well this works."
    (interactive)
    (setq gptel-context--alist nil)
    (gptel-context-remove)
    (message "Removed all gptel context"))

  (defun md/gptel-context-dwim ()
    "Add context. gptel provides an add dwim function but I don't like how it behaves."
    (interactive)
    (cond
     ;; If the region is active
     ((use-region-p)
      (gptel-context--add-region (current-buffer)
                                 (region-beginning)
                                 (region-end))
      (deactivate-mark))
     ;; If the buffer is not narrowed and is visiting a file
     ((and (not (buffer-narrowed-p))
           (buffer-file-name))
      (gptel-add-file (buffer-file-name)))
     ;; If the buffer is narrowed or is not visiting a file
     (t
      (gptel-add))))

  (defun md/gptel-rewrite-code ()
    "Gptel provides a rewrite feature, but it makes you interact with it through the menu
to accept/reject changes, and I just want something simple that rewrites the region."
    (interactive)
    (if (use-region-p)
        (let ((bounds (cons (region-beginning) (region-end))))
          (gptel-request
              (buffer-substring-no-properties (car bounds) (cdr bounds)) ; the prompt
            :system "You are a code-producing machine. Respond only with the replacement version of the code: NEVER RETURN MARKDOWN,
EXTRA FORMATTING OR ANY OTHER EXPLANATION. Keep the user's original comments in your response as much as possible."
            :buffer (current-buffer)
            :context (cons (set-marker (make-marker) (car bounds))
                           (set-marker (make-marker) (cdr bounds)))
            :callback
            (lambda (response info)
              (if (not response)
                  (message "ChatGPT response failed with: %s" (plist-get info :status))
                (let* ((bounds (plist-get info :context))
                       (beg (car bounds))
                       (end (cdr bounds))
                       (buf (plist-get info :buffer)))
                  (with-current-buffer buf
                    (save-excursion
                      (goto-char beg)
                      (kill-region beg end)
                      (insert response)
                      (set-marker beg nil)
                      (set-marker end nil)
                      (message "Rewrote region. Original region saved to kill-ring."))))))))
      (message "Not in region")))

  (defun md/gptel-send ()
    "Call gptel-send, but only if a topic is set. This is to prevent accidentally calling it in buffers that I don't want to share."
    (interactive)
    (if (derived-mode-p 'org-mode)
        (let* ((gptel-topic (org-entry-get (point) "GPTEL_TOPIC" t)))
          (if gptel-topic
              (gptel-send)
            (message "needs GPTEL_TOPIC property")))
      (gpt-send)))

  (defun md/gptel-org-properties ()
    (interactive)
    (call-interactively 'gptel-org-set-topic)
    (call-interactively 'gptel-org-set-properties))

  :custom
  (gptel-default-mode 'org-mode "Use org in the chat buffer")
  (gptel-log-level 'info "Log requests and responses to buffer")

  :md/bind ((:map (org-mode-map)
                  ("C-c <RET>" . md/gptel-send))
            (:map (md/leader-map)
                  ("G <RET>" . md/gptel-send)
                  ("Gt" . md/gptel-org-properties)
                  ("G+" . md/gptel-context-dwim)
                  ("G-" . md/gptel-context-remove)
                  ("GR" . md/gptel-rewrite-code)
                  ("GG" . gptel))))

(use-package emacs
  :init
