emacs.2023.symlink/init.org
* [[https://github.com/Aider-AI/aider][aider]] utils

Some functions for interacting with aider in a comint buffer. For coding
projects this is more useful than gptel, as it provides proper file edits and
knows more about the codebase structure through the repo map and treesitter etc.

#+begin_src emacs-lisp
(use-package emacs
  :init

  (defun md/aider-project-name ()
    (if (project-current)
        (format "*aider-%s*" (project-name (project-current)))
      (error "Aider: Not in project")))

  (defun md/aider-fill-markdown ()
    "Naive way to provide some text formatting because the output isn't very
readable by default. This relies on the places where org-mode and markdown
overlap, and uses the org element parsing + fill features.

Ideally we would just apply this in the pre-output function to everything, but that
has its own problems because there are false positives that get filled (eg. code
blocks).

Another approach would be to convert the markdown to org syntax, but that has
its own complexity."
    (interactive)
    (let ((parsed (org-element-parse-buffer))
          (end (if (use-region-p) (region-end) (point-max)))
          (start (if (use-region-p) (region-beginning) comint-last-input-start)))
      (let ((elements (append
                       (org-element-map parsed 'item 'identity)
                       (org-element-map parsed 'plain-list 'identity)
                       (org-element-map parsed 'paragraph 'identity))))
        ;; NOTE: we parse the items and then iterate backwards. This allows us
        ;; to mutate document state. If we iterated forwards, then every
        ;; mutation would affect the position of all the elements below which
        ;; makes things more complicated.
        (dolist (element (reverse elements))
          (let ((element-begin (org-element-property :begin element)))
            (when (or (not start)
                      (and (>= element-begin start)
                           (< element-begin end)))
              (save-excursion
                (goto-char element-begin)
                ;; Fill the element so it wraps appropriately for the buffer
                (org-fill-element)

                ;; Guess if this looks like it would be easier to read with a
                ;; newline before the element. Eg. I prefer list items to have
                ;; newlines between them.
                (let ((line-above (save-excursion
                                    (forward-line -1)
                                    (thing-at-point 'line t))))
                  (when (and line-above
                             (not (string-blank-p line-above)))
                    (goto-char element-begin)
                    (when
                        ;; There must be a nicer way than this -- check if we're
                        ;; at the first non-whitespace character in the line. If
                        ;; we're not, then it's possible that we're in a nested
                        ;; element like a paragraph that sits inside a list
                        ;; item, where the "begin" point is actually the start
                        ;; of the text and not the start of the list bullet.
                        (or (bolp)
                            (and (not (bolp))
                                 (save-excursion
                                   (backward-char)
                                   (skip-chars-backward " \t")
                                   (bolp))))
                    (newline)))))))))))

  (defun md/aider-fontify ()
    "Fontify all markdown code blocks in the current buffer.
This builds on the markdown-fontify-code-block-natively behaviour
provided by markdown-mode.

Aider does provide its own markdown highlighting and maybe there's a way to get
that to work via comint, but I like the idea that this is consistent with the
rest of the theme."
    (interactive)
    (save-excursion
      (goto-char (point-min))

      ;; I don't fully understand this but this is what markdown-mode does on
      ;; startup, and it seems to solve the problem of font-lock-mode rewriting
      ;; over our code blocks. Without this the syntax highlighting only works
      ;; if I disable font-lock-mode.
      (add-hook 'syntax-propertize-extend-region-functions
                #'markdown-syntax-propertize-extend-region nil t)
      (add-hook 'jit-lock-after-change-extend-region-functions
                #'markdown-font-lock-extend-region-function t t)
      (setq-local syntax-propertize-function #'markdown-syntax-propertize)
      (syntax-propertize (point-max))

      (while (re-search-forward markdown-regex-gfm-code-block-open nil t)
        (let* ((start (match-beginning 0))
               (lang (string-trim (match-string 0) "```"))
               (end (progn
                      (re-search-forward markdown-regex-gfm-code-block-close nil t)
                      (match-end 0))))
          (markdown-fontify-code-block-natively lang start end)))))

  ;; This function is used as a comint-output-filter-functions function.
  ;; You should adjust so that, after
  (defun md/aider-output-filter-function (string)
    "I'm using this to enable the markdown code highlighting"
    (md/aider-fontify))

  (defun md/aider-preoutput-filter-function (string)
    string)

  (defun md/aider-toggle ()
    "Toggle or start an aider comint buffer"
    (interactive)
    (let ((aider-buffer (get-buffer (md/aider-project-name))))
      (if aider-buffer
          (if (get-buffer-window aider-buffer)
              (delete-window (get-buffer-window aider-buffer))
            (progn
              (switch-to-buffer aider-buffer)
              ;; So it's easy to read and close
              (evil-normal-state)))
        (progn
          ;; Set terminal columns although it doesn't seem to do anything
          (let ((process-environment (append (list "COLUMNS=60") process-environment)))
          ;; NOTE: even though we specify --no-stream, the program output might
          ;; come out in batches. This means we can't rely on a comint output
          ;; filter function to apply the markdown.
            (make-comint-in-buffer (md/aider-project-name) (md/aider-project-name) "aider" nil "--no-stream" "--no-fancy-input" "--no-pretty" "--no-analytics"))
          (switch-to-buffer (md/aider-project-name))
          ;; This gives us highlighting for the markdown syntax that aider uses.
          (font-lock-add-keywords nil markdown-mode-font-lock-keywords)
          ;; By default, when markdown-mode-font-lock-keywords are applied, the
          ;; markup is invisible. Markdown-mode usually calls
          ;; `remove-from-invisibility-spec` to show the markup.
          (remove-from-invisibility-spec 'markdown-markup)
          ;; Try to trigger the code block fontifying when we have the output
          (make-variable-buffer-local 'comint-output-filter-functions)
          (add-to-list 'comint-output-filter-functions 'md/aider-output-filter-function)

          (make-variable-buffer-local 'comint-output-filter-functions)
          (add-to-list 'comint-preoutput-filter-functions 'md/aider-preoutput-filter-function)
          (setq markdown-fontify-code-blocks-natively t)

          (setq fill-column 60)
          (evil-emacs-state)))))

  (defun md/aider-send-command (cmd msg show switch)
    "Send the given command string to the buffer using comint"
    (let ((comint-process (get-buffer-process (md/aider-project-name))))
      (if comint-process
          (progn
            (comint-send-string comint-process (format "%s\n" cmd))
            (accept-process-output comint-process 10 nil t)
            (when msg
              (message msg))
            (when show
              (display-buffer (md/aider-project-name)))
            (when switch
              (switch-to-buffer (md/aider-project-name))))
        (message "No aider process running"))))

  (defun md/aider-drop ()
    "Use /drop to drop current context"
    (interactive)
    (md/aider-send-command "/drop" "Aider: dropped context" t nil))

  (defun md/aider-mode-ask ()
    "Go into /chat-mode ask"
    (interactive)
    (md/aider-send-command "/chat-mode ask" "Aider: ask mode" t nil)
    (when (use-region-p)
      (call-interactively 'md/aider-send-region)))

  (defun md/aider-mode-code ()
    "Go into /chat-mode code"
    (interactive)
    (md/aider-send-command "/chat-mode code" "Aider: code mode" t nil)
    (when (use-region-p)
      (call-interactively 'md/aider-send-region)))

  (defun md/aider-add-file ()
    "Add current visited file to the context"
    (interactive)
    (if (buffer-file-name)
        (let* ((project-root (if (fboundp 'project-current)
                                 (car (last (project-current)))
                               nil))
               (relative-path (if project-root
                                  (file-relative-name buffer-file-name project-root)
                                buffer-file-name)))
          (if relative-path
              (md/aider-send-command (format "/add %s" relative-path) (format "Aider: added %s" relative-path) t nil)))))

  (defun md/aider-send-region (start end)
    "Switch to code mode and send the current region to aider"
    (interactive "r")
    (if (use-region-p)
        (let ((region-text (string-trim (buffer-substring-no-properties start end))))
          ;; Aider will handle multi-line strings if you start and end with a curly brace
          (md/aider-send-command (format "{\n%s\n}" region-text) nil t nil))
      (message "Aider: no region selected")))

  :md/bind ((:map (md/leader-map)
                  ("jg-" . md/aider-drop)
                  ("jg+" . md/aider-add-file)
                  ("jg/" . md/aider-mode-ask)
                  ("jgx" . md/aider-fontify)
                  ("jg!" . md/aider-mode-code)
                  ("jgR" . md/aider-send-region)
                  ("jgq" . md/aider-fill-markdown) ;; similar to q binding
                  ("jgg" . md/aider-toggle)
                  (";g" . md/aider-toggle))))
#+end_src

