emacs.2023.symlink/init.el

  (defun md/aider-project-name ()
    (if (project-current)
        (format "*aider-%s*" (project-name (project-current)))
      (error "Aider: Not in project")))

  (defun md/aider-fontify ()
    "Fontify all markdown code blocks in the current buffer.
This builds on the markdown-fontify-code-block-natively behaviour
provided by markdown-mode.

Aider does provide its own markdown highlighting and maybe there's a way to get
that to work via comint, but I like the idea that this is consistent with the
rest of the theme."
    (interactive)
    (save-excursion
      (goto-char (point-min))

      ;; I don't fully understand this but this is what markdown-mode does on
      ;; startup, and it seems to solve the problem of font-lock-mode rewriting
      ;; over our code blocks. Without this the syntax highlighting only works
      ;; if I disable font-lock-mode.
      (add-hook 'syntax-propertize-extend-region-functions
                #'markdown-syntax-propertize-extend-region nil t)
      (add-hook 'jit-lock-after-change-extend-region-functions
                #'markdown-font-lock-extend-region-function t t)
      (setq-local syntax-propertize-function #'markdown-syntax-propertize)
      (syntax-propertize (point-max))

      (while (re-search-forward markdown-regex-gfm-code-block-open nil t)
        (let* ((markdown-fontify-code-blocks-natively t)
               (start (match-beginning 0))
               (lang (string-trim (match-string 0) "```"))
               (end (progn
                      (re-search-forward markdown-regex-gfm-code-block-close nil t)
                      (match-end 0))))
          (markdown-fontify-code-block-natively lang start end)))))

  (defun md/aider-output-filter-function (STRING)
    "I'm using this to enable the markdown code highlighting"
    (md/aider-fontify))

  (defun md/aider-toggle ()
    "Toggle or start an aider comint buffer"
    (interactive)
    (let ((aider-buffer (get-buffer (md/aider-project-name))))
      (if aider-buffer
          (if (get-buffer-window aider-buffer)
              (delete-window (get-buffer-window aider-buffer))
            (switch-to-buffer aider-buffer))
        (progn
          ;; Set terminal columns although it doesn't seem to do anything
          (let ((process-environment (append (list "COLUMNS=60") process-environment)))
          ;; NOTE: even though we specify --no-stream, the program output might
          ;; come out in batches. This means we can't rely on a comint output
          ;; filter function to apply the markdown.
            (make-comint-in-buffer (md/aider-project-name) (md/aider-project-name) "aider" nil "--no-stream" "--no-fancy-input" "--no-pretty" "--no-analytics"))
          (switch-to-buffer (md/aider-project-name))
          ;; This gives us highlighting for the markdown syntax that aider uses.
          (font-lock-add-keywords nil markdown-mode-font-lock-keywords)
          ;; By default, when markdown-mode-font-lock-keywords are applied, the
          ;; markup is invisible. Markdown-mode usually calls
          ;; `remove-from-invisibility-spec` to show the markup.
          (remove-from-invisibility-spec 'markdown-markup)
          ;; Try to trigger the code block fontifying when we have the output
          (make-variable-buffer-local 'comint-output-filter-functions)
          (add-to-list 'comint-output-filter-functions 'md/aider-output-filter-function)

          (setq fill-column 60)
          (evil-emacs-state)))))

  (defun md/aider-send-command (cmd msg show switch)
    "Send the given command string to the buffer using comint"
    (let ((comint-process (get-buffer-process (md/aider-project-name))))
      (if comint-process
          (progn
            (comint-send-string comint-process (format "%s\n" cmd))
            (accept-process-output comint-process 10 nil t)
            (when msg
              (message msg))
            (when show
              (display-buffer (md/aider-project-name)))
            (when switch
              (switch-to-buffer (md/aider-project-name))))
        (message "No aider process running"))))

  (defun md/aider-drop ()
    "Use /drop to drop current context"
    (interactive)
    (md/aider-send-command "/drop" "Aider: dropped context" t nil))

  (defun md/aider-mode-ask ()
    "Go into /chat-mode ask"
    (interactive)
    (md/aider-send-command "/chat-mode ask" "Aider: ask mode" t nil)
    (when (use-region-p)
      (call-interactively 'md/aider-send-region)))

  (defun md/aider-mode-code ()
    "Go into /chat-mode code"
    (interactive)
    (md/aider-send-command "/chat-mode code" "Aider: code mode" t nil)
    (when (use-region-p)
      (call-interactively 'md/aider-send-region)))

  (defun md/aider-add-file ()
    "Add current visited file to the context"
    (interactive)
    (if (buffer-file-name)
        (let* ((project-root (if (fboundp 'project-current)
                                 (car (last (project-current)))
                               nil))
               (relative-path (if project-root
                                  (file-relative-name buffer-file-name project-root)
                                buffer-file-name)))
          (if relative-path
              (md/aider-send-command (format "/add %s" relative-path) (format "Aider: added %s" relative-path) t nil)))))

  (defun md/aider-send-region (start end)
    "Switch to code mode and send the current region to aider"
    (interactive "r")
    (if (use-region-p)
        (let ((region-text (string-trim (buffer-substring-no-properties start end))))
          ;; Aider will handle multi-line strings if you start and end with a curly brace
          (md/aider-send-command (format "{\n%s\n}" region-text) nil t nil))
      (message "Aider: no region selected")))

  :md/bind ((:map (md/leader-map)
                  ("A-" . md/aider-drop)
                  ("A+" . md/aider-add-file)
                  ("A/" . md/aider-mode-ask)
                  ("Ax" . md/aider-fontify)
                  ("A!" . md/aider-mode-code)
                  ("AR" . md/aider-send-region)
                  (";a" . md/aider-toggle))))
