emacs.2023.symlink/init.org
* Server

Always run the server so I can use emacsclient as my terminal editor.

#+begin_src emacs-lisp
(use-package server
  :config (when (not (server-running-p))
            (server-start)))
#+end_src

* Local

For any machine-specific setup code, I load ~/.local.el~. This is also where I
hook into some code that's not in this file, eg. my list of RSS feeds.

#+begin_src emacs-lisp
(use-package emacs
  :init
  (defconst md/dotfiles-init-local-path "~/.local.el")
  (md/maybe-native-compile-and-load md/dotfiles-init-local-path t)
  (defun md/dotfiles-edit-init-local ()
    (interactive)
    (find-file md/dotfiles-init-local-path))
  :md/bind ((:map (md/leader-map)
                  ("vl" . md/dotfiles-edit-init-local))))
#+end_src

* End

#+BEGIN_SRC emacs-lisp
(message "end of init.el")
#+END_SRC
